# Comparing `tmp/iothpy-1.3.5.tar.gz` & `tmp/iothpy-1.3.6.tar.gz`

## filetype from file(1)

```diff
@@ -1 +1 @@
-gzip compressed data, was "iothpy-1.3.5.tar", last modified: Mon May 27 10:10:15 2024, max compression
+gzip compressed data, was "iothpy-1.3.6.tar", last modified: Tue May 28 09:27:33 2024, max compression
```

## Comparing `iothpy-1.3.5.tar` & `iothpy-1.3.6.tar`

### file list

```diff
@@ -1,37 +1,37 @@
-drwxrwxr-x   0 francesco  (1000) francesco  (1000)        0 2024-05-27 10:10:15.111629 iothpy-1.3.5/
--rw-rw-r--   0 francesco  (1000) francesco  (1000)     1068 2024-05-25 06:31:22.000000 iothpy-1.3.5/CMakeLists.txt
--rw-rw-r--   0 francesco  (1000) francesco  (1000)    26526 2024-03-26 14:33:52.000000 iothpy-1.3.5/LICENSE
--rw-rw-r--   0 francesco  (1000) francesco  (1000)      145 2024-03-26 14:33:52.000000 iothpy-1.3.5/MANIFEST.in
--rw-r--r--   0 francesco  (1000) francesco  (1000)     6516 2024-05-27 10:10:15.111629 iothpy-1.3.5/PKG-INFO
--rw-rw-r--   0 francesco  (1000) francesco  (1000)     6180 2024-03-26 14:33:52.000000 iothpy-1.3.5/README.md
-drwxrwxr-x   0 francesco  (1000) francesco  (1000)        0 2024-05-27 10:10:15.091629 iothpy-1.3.5/_skbuild/
-drwxrwxr-x   0 francesco  (1000) francesco  (1000)        0 2024-05-27 10:10:15.091629 iothpy-1.3.5/_skbuild/linux-x86_64-3.12/
-drwxrwxr-x   0 francesco  (1000) francesco  (1000)        0 2024-05-27 10:10:15.091629 iothpy-1.3.5/_skbuild/linux-x86_64-3.12/cmake-install/

     <5e>   DW_AT_type        : (ref4) <0x69>, char
  <1><62>: Abbrev Number: 15 (DW_TAG_base_type)
     <63>   DW_AT_byte_size   : (data1) 1
     <64>   DW_AT_encoding    : (data1) 6	(signed char)
-    <65>   DW_AT_name        : (strp) (offset: 0x2552): char
+    <65>   DW_AT_name        : (strp) (offset: 0x24f7): char
  <1><69>: Abbrev Number: 22 (DW_TAG_const_type)
     <6a>   DW_AT_type        : (ref4) <0x62>, char
  <1><6e>: Abbrev Number: 15 (DW_TAG_base_type)
     <6f>   DW_AT_byte_size   : (data1) 1
     <70>   DW_AT_encoding    : (data1) 8	(unsigned char)
-    <71>   DW_AT_name        : (strp) (offset: 0x2549): unsigned char
+    <71>   DW_AT_name        : (strp) (offset: 0x24ee): unsigned char
  <1><75>: Abbrev Number: 15 (DW_TAG_base_type)
     <76>   DW_AT_byte_size   : (data1) 4
     <77>   DW_AT_encoding    : (data1) 7	(unsigned)
-    <78>   DW_AT_name        : (strp) (offset: 0x299c): unsigned int
+    <78>   DW_AT_name        : (strp) (offset: 0x2942): unsigned int
  <1><7c>: Abbrev Number: 15 (DW_TAG_base_type)
     <7d>   DW_AT_byte_size   : (data1) 1
     <7e>   DW_AT_encoding    : (data1) 6	(signed char)
-    <7f>   DW_AT_name        : (strp) (offset: 0x254b): signed char
+    <7f>   DW_AT_name        : (strp) (offset: 0x24f0): signed char
  <1><83>: Abbrev Number: 15 (DW_TAG_base_type)
     <84>   DW_AT_byte_size   : (data1) 2
     <85>   DW_AT_encoding    : (data1) 5	(signed)
-    <86>   DW_AT_name        : (strp) (offset: 0x2296): short int
+    <86>   DW_AT_name        : (strp) (offset: 0x223b): short int
  <1><8a>: Abbrev Number: 10 (DW_TAG_typedef)
-    <8b>   DW_AT_name        : (strp) (offset: 0x1d27): __uint32_t
+    <8b>   DW_AT_name        : (strp) (offset: 0x1cda): __uint32_t
     <8f>   DW_AT_decl_file   : (data1) 3
     <90>   DW_AT_decl_line   : (data1) 42
     <91>   DW_AT_decl_column : (data1) 22
     <92>   DW_AT_type        : (ref4) <0x75>, unsigned int
  <1><96>: Abbrev Number: 29 (DW_TAG_pointer_type)
     <97>   DW_AT_byte_size   : (data1) 8
  <1><98>: Abbrev Number: 10 (DW_TAG_typedef)
@@ -87,148 +87,148 @@
     <ae>   DW_AT_decl_file   : (data1) 4
     <af>   DW_AT_decl_line   : (data1) 108
     <b0>   DW_AT_decl_column : (data1) 19
     <b1>   DW_AT_type        : (ref4) <0x98>, __ssize_t, long int
  <1><b5>: Abbrev Number: 15 (DW_TAG_base_type)
     <b6>   DW_AT_byte_size   : (data1) 8
     <b7>   DW_AT_encoding    : (data1) 7	(unsigned)
-    <b8>   DW_AT_name        : (strp) (offset: 0x2992): long long unsigned int
+    <b8>   DW_AT_name        : (strp) (offset: 0x2938): long long unsigned int
  <1><bc>: Abbrev Number: 10 (DW_TAG_typedef)
-    <bd>   DW_AT_name        : (strp) (offset: 0x1d29): uint32_t
+    <bd>   DW_AT_name        : (strp) (offset: 0x1cdc): uint32_t
     <c1>   DW_AT_decl_file   : (data1) 5
     <c2>   DW_AT_decl_line   : (data1) 26
     <c3>   DW_AT_decl_column : (data1) 20
     <c4>   DW_AT_type        : (ref4) <0x8a>, __uint32_t, unsigned int
  <1><c8>: Abbrev Number: 10 (DW_TAG_typedef)
-    <c9>   DW_AT_name        : (strp) (offset: 0x2a4b): Py_ssize_t
+    <c9>   DW_AT_name        : (strp) (offset: 0x29f1): Py_ssize_t
     <cd>   DW_AT_decl_file   : (data1) 6
     <ce>   DW_AT_decl_line   : (data1) 131
     <cf>   DW_AT_decl_column : (data1) 25
     <d0>   DW_AT_type        : (ref4) <0xa9>, ssize_t, __ssize_t, long int
  <1><d4>: Abbrev Number: 10 (DW_TAG_typedef)
-    <d5>   DW_AT_name        : (strp) (offset: 0x872): Py_hash_t
+    <d5>   DW_AT_name        : (strp) (offset: 0x850): Py_hash_t
     <d9>   DW_AT_decl_file   : (data1) 6
     <da>   DW_AT_decl_line   : (data1) 145
     <db>   DW_AT_decl_column : (data1) 20
     <dc>   DW_AT_type        : (ref4) <0xc8>, Py_ssize_t, ssize_t, __ssize_t, long int
  <1><e0>: Abbrev Number: 15 (DW_TAG_base_type)
     <e1>   DW_AT_byte_size   : (data1) 4
     <e2>   DW_AT_encoding    : (data1) 4	(float)
-    <e3>   DW_AT_name        : (strp) (offset: 0xdf1): float
+    <e3>   DW_AT_name        : (strp) (offset: 0xdc4): float
  <1><e7>: Abbrev Number: 15 (DW_TAG_base_type)
     <e8>   DW_AT_byte_size   : (data1) 8
     <e9>   DW_AT_encoding    : (data1) 4	(float)
-    <ea>   DW_AT_name        : (strp) (offset: 0x1f07): double
+    <ea>   DW_AT_name        : (strp) (offset: 0x1eba): double
  <1><ee>: Abbrev Number: 15 (DW_TAG_base_type)
     <ef>   DW_AT_byte_size   : (data1) 16
     <f0>   DW_AT_encoding    : (data1) 5	(signed)
-    <f1>   DW_AT_name        : (strp) (offset: 0x2e7b): __int128
+    <f1>   DW_AT_name        : (strp) (offset: 0x2e0e): __int128
  <1><f5>: Abbrev Number: 15 (DW_TAG_base_type)
     <f6>   DW_AT_byte_size   : (data1) 16
     <f7>   DW_AT_encoding    : (data1) 7	(unsigned)
-    <f8>   DW_AT_name        : (strp) (offset: 0xd12): __int128 unsigned
+    <f8>   DW_AT_name        : (strp) (offset: 0xce5): __int128 unsigned
  <1><fc>: Abbrev Number: 10 (DW_TAG_typedef)
-    <fd>   DW_AT_name        : (strp) (offset: 0x1d43): PyModuleDef
+    <fd>   DW_AT_name        : (strp) (offset: 0x1cf6): PyModuleDef
     <101>   DW_AT_decl_file   : (data1) 7
     <102>   DW_AT_decl_line   : (data1) 12
     <103>   DW_AT_decl_column : (data1) 28
     <104>   DW_AT_type        : (ref4) <0x108>, PyModuleDef
  <1><108>: Abbrev Number: 18 (DW_TAG_structure_type)
-    <109>   DW_AT_name        : (strp) (offset: 0x1d43): PyModuleDef
+    <109>   DW_AT_name        : (strp) (offset: 0x1cf6): PyModuleDef
     <10d>   DW_AT_byte_size   : (data1) 104
     <10e>   DW_AT_decl_file   : (data1) 8
     <10f>   DW_AT_decl_line   : (data1) 98
     <110>   DW_AT_decl_column : (data1) 8
     <111>   DW_AT_sibling     : (ref4) <0x18b>
  <2><115>: Abbrev Number: 2 (DW_TAG_member)
-    <116>   DW_AT_name        : (strp) (offset: 0x3937): m_base
+    <116>   DW_AT_name        : (strp) (offset: 0x3898): m_base
     <11a>   DW_AT_decl_file   : (data1) 8
     <11b>   DW_AT_decl_line   : (data1) 99
     <11c>   DW_AT_decl_column : (data1) 20
     <11d>   DW_AT_type        : (ref4) <0xe5d>, PyModuleDef_Base, PyModuleDef_Base
     <121>   DW_AT_data_member_location: (data1) 0
  <2><122>: Abbrev Number: 2 (DW_TAG_member)
-    <123>   DW_AT_name        : (strp) (offset: 0x305c): m_name
+    <123>   DW_AT_name        : (strp) (offset: 0x2fef): m_name
     <127>   DW_AT_decl_file   : (data1) 8
     <128>   DW_AT_decl_line   : (data1) 100
     <129>   DW_AT_decl_column : (data1) 15
     <12a>   DW_AT_type        : (ref4) <0x5d>
     <12e>   DW_AT_data_member_location: (data1) 40
  <2><12f>: Abbrev Number: 2 (DW_TAG_member)
-    <130>   DW_AT_name        : (strp) (offset: 0x1ea6): m_doc
+    <130>   DW_AT_name        : (strp) (offset: 0x1e59): m_doc
     <134>   DW_AT_decl_file   : (data1) 8
     <135>   DW_AT_decl_line   : (data1) 101
     <136>   DW_AT_decl_column : (data1) 15
     <137>   DW_AT_type        : (ref4) <0x5d>
     <13b>   DW_AT_data_member_location: (data1) 48
  <2><13c>: Abbrev Number: 2 (DW_TAG_member)
-    <13d>   DW_AT_name        : (strp) (offset: 0x15b5): m_size
+    <13d>   DW_AT_name        : (strp) (offset: 0x1584): m_size
     <141>   DW_AT_decl_file   : (data1) 8
     <142>   DW_AT_decl_line   : (data1) 102
     <143>   DW_AT_decl_column : (data1) 14
     <144>   DW_AT_type        : (ref4) <0xc8>, Py_ssize_t, ssize_t, __ssize_t, long int
     <148>   DW_AT_data_member_location: (data1) 56
  <2><149>: Abbrev Number: 2 (DW_TAG_member)
-    <14a>   DW_AT_name        : (strp) (offset: 0x3b28): m_methods
+    <14a>   DW_AT_name        : (strp) (offset: 0x3a71): m_methods
     <14e>   DW_AT_decl_file   : (data1) 8
     <14f>   DW_AT_decl_line   : (data1) 103
     <150>   DW_AT_decl_column : (data1) 16
     <151>   DW_AT_type        : (ref4) <0xdf6>
     <155>   DW_AT_data_member_location: (data1) 64
  <2><156>: Abbrev Number: 2 (DW_TAG_member)
-    <157>   DW_AT_name        : (strp) (offset: 0x26c9): m_slots
+    <157>   DW_AT_name        : (strp) (offset: 0x2672): m_slots
     <15b>   DW_AT_decl_file   : (data1) 8
     <15c>   DW_AT_decl_line   : (data1) 104
     <15d>   DW_AT_decl_column : (data1) 21
     <15e>   DW_AT_type        : (ref4) <0xe69>
     <162>   DW_AT_data_member_location: (data1) 72
  <2><163>: Abbrev Number: 2 (DW_TAG_member)
-    <164>   DW_AT_name        : (strp) (offset: 0x27ac): m_traverse
+    <164>   DW_AT_name        : (strp) (offset: 0x2755): m_traverse
     <168>   DW_AT_decl_file   : (data1) 8
     <169>   DW_AT_decl_line   : (data1) 105
     <16a>   DW_AT_decl_column : (data1) 16
     <16b>   DW_AT_type        : (ref4) <0x86e>, traverseproc
     <16f>   DW_AT_data_member_location: (data1) 80
  <2><170>: Abbrev Number: 2 (DW_TAG_member)
-    <171>   DW_AT_name        : (strp) (offset: 0x1c80): m_clear
+    <171>   DW_AT_name        : (strp) (offset: 0x1c33): m_clear
     <175>   DW_AT_decl_file   : (data1) 8
     <176>   DW_AT_decl_line   : (data1) 106
     <177>   DW_AT_decl_column : (data1) 11
     <178>   DW_AT_type        : (ref4) <0x76b>, inquiry
     <17c>   DW_AT_data_member_location: (data1) 88
  <2><17d>: Abbrev Number: 2 (DW_TAG_member)
-    <17e>   DW_AT_name        : (strp) (offset: 0x37fa): m_free
+    <17e>   DW_AT_name        : (strp) (offset: 0x375b): m_free
     <182>   DW_AT_decl_file   : (data1) 8
     <183>   DW_AT_decl_line   : (data1) 107
     <184>   DW_AT_decl_column : (data1) 12
     <185>   DW_AT_type        : (ref4) <0x898>, freefunc
     <189>   DW_AT_data_member_location: (data1) 96
  <2><18a>: Abbrev Number: 0
  <1><18b>: Abbrev Number: 10 (DW_TAG_typedef)
-    <18c>   DW_AT_name        : (strp) (offset: 0x1f32): PyModuleDef_Slot
+    <18c>   DW_AT_name        : (strp) (offset: 0x1ee5): PyModuleDef_Slot
     <190>   DW_AT_decl_file   : (data1) 7
     <191>   DW_AT_decl_line   : (data1) 13
     <192>   DW_AT_decl_column : (data1) 33
     <193>   DW_AT_type        : (ref4) <0x197>, PyModuleDef_Slot
  <1><197>: Abbrev Number: 18 (DW_TAG_structure_type)
-    <198>   DW_AT_name        : (strp) (offset: 0x1f32): PyModuleDef_Slot
+    <198>   DW_AT_name        : (strp) (offset: 0x1ee5): PyModuleDef_Slot
     <19c>   DW_AT_byte_size   : (data1) 16
     <19d>   DW_AT_decl_file   : (data1) 8
     <19e>   DW_AT_decl_line   : (data1) 74
     <19f>   DW_AT_decl_column : (data1) 8
     <1a0>   DW_AT_sibling     : (ref4) <0x1bf>
  <2><1a4>: Abbrev Number: 2 (DW_TAG_member)
-    <1a5>   DW_AT_name        : (strp) (offset: 0x90c): slot
+    <1a5>   DW_AT_name        : (strp) (offset: 0x8ea): slot
     <1a9>   DW_AT_decl_file   : (data1) 8
     <1aa>   DW_AT_decl_line   : (data1) 75
     <1ab>   DW_AT_decl_column : (data1) 9
     <1ac>   DW_AT_type        : (ref4) <0x41>, int
     <1b0>   DW_AT_data_member_location: (data1) 0
  <2><1b1>: Abbrev Number: 2 (DW_TAG_member)
-    <1b2>   DW_AT_name        : (strp) (offset: 0x2ae6): value
+    <1b2>   DW_AT_name        : (strp) (offset: 0x2a8c): value
     <1b6>   DW_AT_decl_file   : (data1) 8
     <1b7>   DW_AT_decl_line   : (data1) 76
     <1b8>   DW_AT_decl_column : (data1) 11
     <1b9>   DW_AT_type        : (ref4) <0x96>
     <1bd>   DW_AT_data_member_location: (data1) 8
  <2><1be>: Abbrev Number: 0
  <1><1bf>: Abbrev Number: 10 (DW_TAG_typedef)
@@ -241,57 +241,57 @@
     <1cc>   DW_AT_name        : (strp) (offset: 0x1ce): PyMethodDef
     <1d0>   DW_AT_byte_size   : (data1) 32
     <1d1>   DW_AT_decl_file   : (data1) 9
     <1d2>   DW_AT_decl_line   : (data1) 54
     <1d3>   DW_AT_decl_column : (data1) 8
     <1d4>   DW_AT_sibling     : (ref4) <0x20d>
  <2><1d8>: Abbrev Number: 2 (DW_TAG_member)
-    <1d9>   DW_AT_name        : (strp) (offset: 0x3c65): ml_name
+    <1d9>   DW_AT_name        : (strp) (offset: 0x3bae): ml_name
     <1dd>   DW_AT_decl_file   : (data1) 9
     <1de>   DW_AT_decl_line   : (data1) 55
     <1df>   DW_AT_decl_column : (data1) 18
     <1e0>   DW_AT_type        : (ref4) <0x5d>
     <1e4>   DW_AT_data_member_location: (data1) 0
  <2><1e5>: Abbrev Number: 2 (DW_TAG_member)
-    <1e6>   DW_AT_name        : (strp) (offset: 0x1f2a): ml_meth
+    <1e6>   DW_AT_name        : (strp) (offset: 0x1edd): ml_meth
     <1ea>   DW_AT_decl_file   : (data1) 9
     <1eb>   DW_AT_decl_line   : (data1) 56
     <1ec>   DW_AT_decl_column : (data1) 17
     <1ed>   DW_AT_type        : (ref4) <0xe05>, PyCFunction
     <1f1>   DW_AT_data_member_location: (data1) 8
  <2><1f2>: Abbrev Number: 2 (DW_TAG_member)
-    <1f3>   DW_AT_name        : (strp) (offset: 0x361d): ml_flags
+    <1f3>   DW_AT_name        : (strp) (offset: 0x357e): ml_flags
     <1f7>   DW_AT_decl_file   : (data1) 9
     <1f8>   DW_AT_decl_line   : (data1) 57
     <1f9>   DW_AT_decl_column : (data1) 17
     <1fa>   DW_AT_type        : (ref4) <0x41>, int
     <1fe>   DW_AT_data_member_location: (data1) 16
  <2><1ff>: Abbrev Number: 2 (DW_TAG_member)
-    <200>   DW_AT_name        : (strp) (offset: 0x18e1): ml_doc
+    <200>   DW_AT_name        : (strp) (offset: 0x1894): ml_doc
     <204>   DW_AT_decl_file   : (data1) 9
     <205>   DW_AT_decl_line   : (data1) 59
     <206>   DW_AT_decl_column : (data1) 18
     <207>   DW_AT_type        : (ref4) <0x5d>
     <20b>   DW_AT_data_member_location: (data1) 24
  <2><20c>: Abbrev Number: 0
  <1><20d>: Abbrev Number: 10 (DW_TAG_typedef)
-    <20e>   DW_AT_name        : (strp) (offset: 0x2ec5): PyGetSetDef
+    <20e>   DW_AT_name        : (strp) (offset: 0x2e58): PyGetSetDef
     <212>   DW_AT_decl_file   : (data1) 7
     <213>   DW_AT_decl_line   : (data1) 15
     <214>   DW_AT_decl_column : (data1) 28
     <215>   DW_AT_type        : (ref4) <0x219>, PyGetSetDef
  <1><219>: Abbrev Number: 18 (DW_TAG_structure_type)
-    <21a>   DW_AT_name        : (strp) (offset: 0x2ec5): PyGetSetDef
+    <21a>   DW_AT_name        : (strp) (offset: 0x2e58): PyGetSetDef
     <21e>   DW_AT_byte_size   : (data1) 40
     <21f>   DW_AT_decl_file   : (data1) 10
     <220>   DW_AT_decl_line   : (data1) 11
     <221>   DW_AT_decl_column : (data1) 8
     <222>   DW_AT_sibling     : (ref4) <0x268>
  <2><226>: Abbrev Number: 2 (DW_TAG_member)
-    <227>   DW_AT_name        : (strp) (offset: 0x3c68): name
+    <227>   DW_AT_name        : (strp) (offset: 0x3bb1): name
     <22b>   DW_AT_decl_file   : (data1) 10
     <22c>   DW_AT_decl_line   : (data1) 12
     <22d>   DW_AT_decl_column : (data1) 17
     <22e>   DW_AT_type        : (ref4) <0x5d>
     <232>   DW_AT_data_member_location: (data1) 0
  <2><233>: Abbrev Number: 19 (DW_TAG_member)
     <234>   DW_AT_name        : (string) get
@@ -311,452 +311,452 @@
     <24e>   DW_AT_name        : (string) doc
     <252>   DW_AT_decl_file   : (data1) 10
     <253>   DW_AT_decl_line   : (data1) 15
     <254>   DW_AT_decl_column : (data1) 17
     <255>   DW_AT_type        : (ref4) <0x5d>
     <259>   DW_AT_data_member_location: (data1) 24
  <2><25a>: Abbrev Number: 2 (DW_TAG_member)
-    <25b>   DW_AT_name        : (strp) (offset: 0x1854): closure
+    <25b>   DW_AT_name        : (strp) (offset: 0x1807): closure
     <25f>   DW_AT_decl_file   : (data1) 10
     <260>   DW_AT_decl_line   : (data1) 16
     <261>   DW_AT_decl_column : (data1) 11
     <262>   DW_AT_type        : (ref4) <0x96>
     <266>   DW_AT_data_member_location: (data1) 32
  <2><267>: Abbrev Number: 0
  <1><268>: Abbrev Number: 10 (DW_TAG_typedef)
-    <269>   DW_AT_name        : (strp) (offset: 0xf76): PyMemberDef
+    <269>   DW_AT_name        : (strp) (offset: 0xf49): PyMemberDef
     <26d>   DW_AT_decl_file   : (data1) 7
     <26e>   DW_AT_decl_line   : (data1) 16
     <26f>   DW_AT_decl_column : (data1) 28
     <270>   DW_AT_type        : (ref4) <0x274>, PyMemberDef
  <1><274>: Abbrev Number: 18 (DW_TAG_structure_type)
-    <275>   DW_AT_name        : (strp) (offset: 0xf76): PyMemberDef
+    <275>   DW_AT_name        : (strp) (offset: 0xf49): PyMemberDef
     <279>   DW_AT_byte_size   : (data1) 40
     <27a>   DW_AT_decl_file   : (data1) 10
     <27b>   DW_AT_decl_line   : (data1) 41
     <27c>   DW_AT_decl_column : (data1) 8
     <27d>   DW_AT_sibling     : (ref4) <0x2c3>
  <2><281>: Abbrev Number: 2 (DW_TAG_member)
-    <282>   DW_AT_name        : (strp) (offset: 0x3c68): name
+    <282>   DW_AT_name        : (strp) (offset: 0x3bb1): name
     <286>   DW_AT_decl_file   : (data1) 10
     <287>   DW_AT_decl_line   : (data1) 42
     <288>   DW_AT_decl_column : (data1) 17
     <289>   DW_AT_type        : (ref4) <0x5d>
     <28d>   DW_AT_data_member_location: (data1) 0
  <2><28e>: Abbrev Number: 2 (DW_TAG_member)
-    <28f>   DW_AT_name        : (strp) (offset: 0x37f5): type
+    <28f>   DW_AT_name        : (strp) (offset: 0x3756): type
     <293>   DW_AT_decl_file   : (data1) 10
     <294>   DW_AT_decl_line   : (data1) 43
     <295>   DW_AT_decl_column : (data1) 9
     <296>   DW_AT_type        : (ref4) <0x41>, int
     <29a>   DW_AT_data_member_location: (data1) 8
  <2><29b>: Abbrev Number: 2 (DW_TAG_member)
-    <29c>   DW_AT_name        : (strp) (offset: 0xf23): offset
+    <29c>   DW_AT_name        : (strp) (offset: 0xef6): offset
     <2a0>   DW_AT_decl_file   : (data1) 10
     <2a1>   DW_AT_decl_line   : (data1) 44
     <2a2>   DW_AT_decl_column : (data1) 16
     <2a3>   DW_AT_type        : (ref4) <0xc8>, Py_ssize_t, ssize_t, __ssize_t, long int
     <2a7>   DW_AT_data_member_location: (data1) 16
  <2><2a8>: Abbrev Number: 2 (DW_TAG_member)
-    <2a9>   DW_AT_name        : (strp) (offset: 0x3620): flags
+    <2a9>   DW_AT_name        : (strp) (offset: 0x3581): flags
     <2ad>   DW_AT_decl_file   : (data1) 10
     <2ae>   DW_AT_decl_line   : (data1) 45
     <2af>   DW_AT_decl_column : (data1) 9
     <2b0>   DW_AT_type        : (ref4) <0x41>, int
     <2b4>   DW_AT_data_member_location: (data1) 24
  <2><2b5>: Abbrev Number: 19 (DW_TAG_member)
     <2b6>   DW_AT_name        : (string) doc
     <2ba>   DW_AT_decl_file   : (data1) 10
     <2bb>   DW_AT_decl_line   : (data1) 46
     <2bc>   DW_AT_decl_column : (data1) 17
     <2bd>   DW_AT_type        : (ref4) <0x5d>
     <2c1>   DW_AT_data_member_location: (data1) 32
  <2><2c2>: Abbrev Number: 0
  <1><2c3>: Abbrev Number: 10 (DW_TAG_typedef)
-    <2c4>   DW_AT_name        : (strp) (offset: 0x1f58): PyObject
+    <2c4>   DW_AT_name        : (strp) (offset: 0x1f0b): PyObject
     <2c8>   DW_AT_decl_file   : (data1) 7
     <2c9>   DW_AT_decl_line   : (data1) 18
     <2ca>   DW_AT_decl_column : (data1) 24
     <2cb>   DW_AT_type        : (ref4) <0x2cf>, _object
  <1><2cf>: Abbrev Number: 18 (DW_TAG_structure_type)
-    <2d0>   DW_AT_name        : (strp) (offset: 0x373b): _object
+    <2d0>   DW_AT_name        : (strp) (offset: 0x369c): _object
     <2d4>   DW_AT_byte_size   : (data1) 16
     <2d5>   DW_AT_decl_file   : (data1) 11
     <2d6>   DW_AT_decl_line   : (data1) 166
     <2d7>   DW_AT_decl_column : (data1) 8
     <2d8>   DW_AT_sibling     : (ref4) <0x2f0>
  <2><2dc>: Abbrev Number: 30 (DW_TAG_member)
     <2dd>   DW_AT_type        : (ref4) <0x698>
     <2e1>   DW_AT_data_member_location: (data1) 0
  <2><2e2>: Abbrev Number: 2 (DW_TAG_member)
-    <2e3>   DW_AT_name        : (strp) (offset: 0x37f2): ob_type
+    <2e3>   DW_AT_name        : (strp) (offset: 0x3753): ob_type
     <2e7>   DW_AT_decl_file   : (data1) 11
     <2e8>   DW_AT_decl_line   : (data1) 190
     <2e9>   DW_AT_decl_column : (data1) 19
     <2ea>   DW_AT_type        : (ref4) <0x6c8>
     <2ee>   DW_AT_data_member_location: (data1) 8
  <2><2ef>: Abbrev Number: 0
  <1><2f0>: Abbrev Number: 10 (DW_TAG_typedef)
-    <2f1>   DW_AT_name        : (strp) (offset: 0x1256): PyTypeObject
+    <2f1>   DW_AT_name        : (strp) (offset: 0x1229): PyTypeObject
     <2f5>   DW_AT_decl_file   : (data1) 7
     <2f6>   DW_AT_decl_line   : (data1) 20
     <2f7>   DW_AT_decl_column : (data1) 28
     <2f8>   DW_AT_type        : (ref4) <0x2fc>, _typeobject
  <1><2fc>: Abbrev Number: 31 (DW_TAG_structure_type)
-    <2fd>   DW_AT_name        : (strp) (offset: 0x1b1a): _typeobject
+    <2fd>   DW_AT_name        : (strp) (offset: 0x1acd): _typeobject
     <301>   DW_AT_byte_size   : (data2) 416
     <303>   DW_AT_decl_file   : (data1) 12
     <304>   DW_AT_decl_line   : (data1) 146
     <305>   DW_AT_decl_column : (data1) 8
     <306>   DW_AT_sibling     : (ref4) <0x595>
  <2><30a>: Abbrev Number: 2 (DW_TAG_member)
-    <30b>   DW_AT_name        : (strp) (offset: 0x5be): ob_base
+    <30b>   DW_AT_name        : (strp) (offset: 0x59c): ob_base
     <30f>   DW_AT_decl_file   : (data1) 12
     <310>   DW_AT_decl_line   : (data1) 147
     <311>   DW_AT_decl_column : (data1) 5
     <312>   DW_AT_type        : (ref4) <0x6f0>, PyVarObject
     <316>   DW_AT_data_member_location: (data1) 0
  <2><317>: Abbrev Number: 2 (DW_TAG_member)
-    <318>   DW_AT_name        : (strp) (offset: 0x70c): tp_name
+    <318>   DW_AT_name        : (strp) (offset: 0x6ea): tp_name
     <31c>   DW_AT_decl_file   : (data1) 12
     <31d>   DW_AT_decl_line   : (data1) 148
     <31e>   DW_AT_decl_column : (data1) 17
     <31f>   DW_AT_type        : (ref4) <0x5d>
     <323>   DW_AT_data_member_location: (data1) 24
  <2><324>: Abbrev Number: 2 (DW_TAG_member)
-    <325>   DW_AT_name        : (strp) (offset: 0x226f): tp_basicsize
+    <325>   DW_AT_name        : (strp) (offset: 0x2214): tp_basicsize
     <329>   DW_AT_decl_file   : (data1) 12
     <32a>   DW_AT_decl_line   : (data1) 149
     <32b>   DW_AT_decl_column : (data1) 16
     <32c>   DW_AT_type        : (ref4) <0xc8>, Py_ssize_t, ssize_t, __ssize_t, long int
     <330>   DW_AT_data_member_location: (data1) 32
  <2><331>: Abbrev Number: 2 (DW_TAG_member)
-    <332>   DW_AT_name        : (strp) (offset: 0x3131): tp_itemsize
+    <332>   DW_AT_name        : (strp) (offset: 0x30c4): tp_itemsize
     <336>   DW_AT_decl_file   : (data1) 12
     <337>   DW_AT_decl_line   : (data1) 149
     <338>   DW_AT_decl_column : (data1) 30
     <339>   DW_AT_type        : (ref4) <0xc8>, Py_ssize_t, ssize_t, __ssize_t, long int
     <33d>   DW_AT_data_member_location: (data1) 40
  <2><33e>: Abbrev Number: 2 (DW_TAG_member)
-    <33f>   DW_AT_name        : (strp) (offset: 0x274): tp_dealloc
+    <33f>   DW_AT_name        : (strp) (offset: 0x25e): tp_dealloc
     <343>   DW_AT_decl_file   : (data1) 12
     <344>   DW_AT_decl_line   : (data1) 153
     <345>   DW_AT_decl_column : (data1) 16
     <346>   DW_AT_type        : (ref4) <0x8b4>, destructor
     <34a>   DW_AT_data_member_location: (data1) 48
  <2><34b>: Abbrev Number: 2 (DW_TAG_member)
-    <34c>   DW_AT_name        : (strp) (offset: 0xf15): tp_vectorcall_offset
+    <34c>   DW_AT_name        : (strp) (offset: 0xee8): tp_vectorcall_offset
     <350>   DW_AT_decl_file   : (data1) 12
     <351>   DW_AT_decl_line   : (data1) 154
     <352>   DW_AT_decl_column : (data1) 16
     <353>   DW_AT_type        : (ref4) <0xc8>, Py_ssize_t, ssize_t, __ssize_t, long int
     <357>   DW_AT_data_member_location: (data1) 56
  <2><358>: Abbrev Number: 2 (DW_TAG_member)
-    <359>   DW_AT_name        : (strp) (offset: 0x2f81): tp_getattr
+    <359>   DW_AT_name        : (strp) (offset: 0x2f14): tp_getattr
     <35d>   DW_AT_decl_file   : (data1) 12
     <35e>   DW_AT_decl_line   : (data1) 155
     <35f>   DW_AT_decl_column : (data1) 17
     <360>   DW_AT_type        : (ref4) <0x8d0>, getattrfunc
     <364>   DW_AT_data_member_location: (data1) 64
  <2><365>: Abbrev Number: 2 (DW_TAG_member)
-    <366>   DW_AT_name        : (strp) (offset: 0x16d2): tp_setattr
+    <366>   DW_AT_name        : (strp) (offset: 0x16a1): tp_setattr
     <36a>   DW_AT_decl_file   : (data1) 12
     <36b>   DW_AT_decl_line   : (data1) 156
     <36c>   DW_AT_decl_column : (data1) 17
     <36d>   DW_AT_type        : (ref4) <0x901>, setattrfunc
     <371>   DW_AT_data_member_location: (data1) 72
  <2><372>: Abbrev Number: 2 (DW_TAG_member)
-    <373>   DW_AT_name        : (strp) (offset: 0x2e30): tp_as_async
+    <373>   DW_AT_name        : (strp) (offset: 0x2dc3): tp_as_async
     <377>   DW_AT_decl_file   : (data1) 12
     <378>   DW_AT_decl_line   : (data1) 157
     <379>   DW_AT_decl_column : (data1) 21
     <37a>   DW_AT_type        : (ref4) <0xddd>
     <37e>   DW_AT_data_member_location: (data1) 80
  <2><37f>: Abbrev Number: 2 (DW_TAG_member)
-    <380>   DW_AT_name        : (strp) (offset: 0x3b5): tp_repr
+    <380>   DW_AT_name        : (strp) (offset: 0x39f): tp_repr
     <384>   DW_AT_decl_file   : (data1) 12
     <385>   DW_AT_decl_line   : (data1) 159
     <386>   DW_AT_decl_column : (data1) 14
     <387>   DW_AT_type        : (ref4) <0x937>, reprfunc
     <38b>   DW_AT_data_member_location: (data1) 88
  <2><38c>: Abbrev Number: 2 (DW_TAG_member)
-    <38d>   DW_AT_name        : (strp) (offset: 0x32e9): tp_as_number
+    <38d>   DW_AT_name        : (strp) (offset: 0x3270): tp_as_number
     <391>   DW_AT_decl_file   : (data1) 12
     <392>   DW_AT_decl_line   : (data1) 163
     <393>   DW_AT_decl_column : (data1) 22
     <394>   DW_AT_type        : (ref4) <0xde2>
     <398>   DW_AT_data_member_location: (data1) 96
  <2><399>: Abbrev Number: 2 (DW_TAG_member)
-    <39a>   DW_AT_name        : (strp) (offset: 0x3a6): tp_as_sequence
+    <39a>   DW_AT_name        : (strp) (offset: 0x390): tp_as_sequence
     <39e>   DW_AT_decl_file   : (data1) 12
     <39f>   DW_AT_decl_line   : (data1) 164
     <3a0>   DW_AT_decl_column : (data1) 24
     <3a1>   DW_AT_type        : (ref4) <0xde7>
     <3a5>   DW_AT_data_member_location: (data1) 104
  <2><3a6>: Abbrev Number: 2 (DW_TAG_member)
-    <3a7>   DW_AT_name        : (strp) (offset: 0x16b0): tp_as_mapping
+    <3a7>   DW_AT_name        : (strp) (offset: 0x167f): tp_as_mapping
     <3ab>   DW_AT_decl_file   : (data1) 12
     <3ac>   DW_AT_decl_line   : (data1) 165
     <3ad>   DW_AT_decl_column : (data1) 23
     <3ae>   DW_AT_type        : (ref4) <0xdec>
     <3b2>   DW_AT_data_member_location: (data1) 112
  <2><3b3>: Abbrev Number: 2 (DW_TAG_member)
-    <3b4>   DW_AT_name        : (strp) (offset: 0x10e7): tp_hash
+    <3b4>   DW_AT_name        : (strp) (offset: 0x10ba): tp_hash
     <3b8>   DW_AT_decl_file   : (data1) 12
     <3b9>   DW_AT_decl_line   : (data1) 169
     <3ba>   DW_AT_decl_column : (data1) 14
     <3bb>   DW_AT_type        : (ref4) <0x943>, hashfunc
     <3bf>   DW_AT_data_member_location: (data1) 120
  <2><3c0>: Abbrev Number: 2 (DW_TAG_member)
-    <3c1>   DW_AT_name        : (strp) (offset: 0x3314): tp_call
+    <3c1>   DW_AT_name        : (strp) (offset: 0x329b): tp_call
     <3c5>   DW_AT_decl_file   : (data1) 12
     <3c6>   DW_AT_decl_line   : (data1) 170
     <3c7>   DW_AT_decl_column : (data1) 17
     <3c8>   DW_AT_type        : (ref4) <0x741>, ternaryfunc
     <3cc>   DW_AT_data_member_location: (data1) 128
  <2><3cd>: Abbrev Number: 2 (DW_TAG_member)
-    <3ce>   DW_AT_name        : (strp) (offset: 0x3648): tp_str
+    <3ce>   DW_AT_name        : (strp) (offset: 0x35a9): tp_str
     <3d2>   DW_AT_decl_file   : (data1) 12
     <3d3>   DW_AT_decl_line   : (data1) 171
     <3d4>   DW_AT_decl_column : (data1) 14
     <3d5>   DW_AT_type        : (ref4) <0x937>, reprfunc
     <3d9>   DW_AT_data_member_location: (data1) 136
  <2><3da>: Abbrev Number: 2 (DW_TAG_member)
-    <3db>   DW_AT_name        : (strp) (offset: 0x1373): tp_getattro
+    <3db>   DW_AT_name        : (strp) (offset: 0x1342): tp_getattro
     <3df>   DW_AT_decl_file   : (data1) 12
     <3e0>   DW_AT_decl_line   : (data1) 172
     <3e1>   DW_AT_decl_column : (data1) 18
     <3e2>   DW_AT_type        : (ref4) <0x8f5>, getattrofunc
     <3e6>   DW_AT_data_member_location: (data1) 144
  <2><3e7>: Abbrev Number: 2 (DW_TAG_member)
-    <3e8>   DW_AT_name        : (strp) (offset: 0x2516): tp_setattro
+    <3e8>   DW_AT_name        : (strp) (offset: 0x24bb): tp_setattro
     <3ec>   DW_AT_decl_file   : (data1) 12
     <3ed>   DW_AT_decl_line   : (data1) 173
     <3ee>   DW_AT_decl_column : (data1) 18
     <3ef>   DW_AT_type        : (ref4) <0x92b>, setattrofunc
     <3f3>   DW_AT_data_member_location: (data1) 152
  <2><3f4>: Abbrev Number: 2 (DW_TAG_member)
-    <3f5>   DW_AT_name        : (strp) (offset: 0x323a): tp_as_buffer
+    <3f5>   DW_AT_name        : (strp) (offset: 0x31c1): tp_as_buffer
     <3f9>   DW_AT_decl_file   : (data1) 12
     <3fa>   DW_AT_decl_line   : (data1) 176
     <3fb>   DW_AT_decl_column : (data1) 20
     <3fc>   DW_AT_type        : (ref4) <0xdf1>
     <400>   DW_AT_data_member_location: (data1) 160
  <2><401>: Abbrev Number: 2 (DW_TAG_member)
-    <402>   DW_AT_name        : (strp) (offset: 0x1b63): tp_flags
+    <402>   DW_AT_name        : (strp) (offset: 0x1b16): tp_flags
     <406>   DW_AT_decl_file   : (data1) 12
     <407>   DW_AT_decl_line   : (data1) 179
     <408>   DW_AT_decl_column : (data1) 19
     <409>   DW_AT_type        : (ref4) <0x3a>, long unsigned int
     <40d>   DW_AT_data_member_location: (data1) 168
  <2><40e>: Abbrev Number: 2 (DW_TAG_member)
-    <40f>   DW_AT_name        : (strp) (offset: 0xc84): tp_doc
+    <40f>   DW_AT_name        : (strp) (offset: 0xc6b): tp_doc
     <413>   DW_AT_decl_file   : (data1) 12
     <414>   DW_AT_decl_line   : (data1) 181
     <415>   DW_AT_decl_column : (data1) 17
     <416>   DW_AT_type        : (ref4) <0x5d>
     <41a>   DW_AT_data_member_location: (data1) 176
  <2><41b>: Abbrev Number: 2 (DW_TAG_member)
-    <41c>   DW_AT_name        : (strp) (offset: 0x2741): tp_traverse
+    <41c>   DW_AT_name        : (strp) (offset: 0x26ea): tp_traverse
     <420>   DW_AT_decl_file   : (data1) 12
     <421>   DW_AT_decl_line   : (data1) 185
     <422>   DW_AT_decl_column : (data1) 18
     <423>   DW_AT_type        : (ref4) <0x86e>, traverseproc
     <427>   DW_AT_data_member_location: (data1) 184
  <2><428>: Abbrev Number: 2 (DW_TAG_member)
-    <429>   DW_AT_name        : (strp) (offset: 0x1ff9): tp_clear
+    <429>   DW_AT_name        : (strp) (offset: 0x1f9e): tp_clear
     <42d>   DW_AT_decl_file   : (data1) 12
     <42e>   DW_AT_decl_line   : (data1) 188
     <42f>   DW_AT_decl_column : (data1) 13
     <430>   DW_AT_type        : (ref4) <0x76b>, inquiry
     <434>   DW_AT_data_member_location: (data1) 192
  <2><435>: Abbrev Number: 2 (DW_TAG_member)
     <436>   DW_AT_name        : (strp) (offset: 0x212): tp_richcompare
     <43a>   DW_AT_decl_file   : (data1) 12
     <43b>   DW_AT_decl_line   : (data1) 192
     <43c>   DW_AT_decl_column : (data1) 17
     <43d>   DW_AT_type        : (ref4) <0x963>, richcmpfunc
     <441>   DW_AT_data_member_location: (data1) 200
  <2><442>: Abbrev Number: 2 (DW_TAG_member)
-    <443>   DW_AT_name        : (strp) (offset: 0x109b): tp_weaklistoffset
+    <443>   DW_AT_name        : (strp) (offset: 0x106e): tp_weaklistoffset
     <447>   DW_AT_decl_file   : (data1) 12
     <448>   DW_AT_decl_line   : (data1) 195
     <449>   DW_AT_decl_column : (data1) 16
     <44a>   DW_AT_type        : (ref4) <0xc8>, Py_ssize_t, ssize_t, __ssize_t, long int
     <44e>   DW_AT_data_member_location: (data1) 208
  <2><44f>: Abbrev Number: 2 (DW_TAG_member)
     <450>   DW_AT_name        : (strp) (offset: 0x179): tp_iter
     <454>   DW_AT_decl_file   : (data1) 12
     <455>   DW_AT_decl_line   : (data1) 198
     <456>   DW_AT_decl_column : (data1) 17
     <457>   DW_AT_type        : (ref4) <0x98d>, getiterfunc
     <45b>   DW_AT_data_member_location: (data1) 216
  <2><45c>: Abbrev Number: 2 (DW_TAG_member)
-    <45d>   DW_AT_name        : (strp) (offset: 0x27d0): tp_iternext
+    <45d>   DW_AT_name        : (strp) (offset: 0x2779): tp_iternext
     <461>   DW_AT_decl_file   : (data1) 12
     <462>   DW_AT_decl_line   : (data1) 199
     <463>   DW_AT_decl_column : (data1) 18
     <464>   DW_AT_type        : (ref4) <0x999>, iternextfunc
     <468>   DW_AT_data_member_location: (data1) 224
  <2><469>: Abbrev Number: 2 (DW_TAG_member)
-    <46a>   DW_AT_name        : (strp) (offset: 0x3bd3): tp_methods
+    <46a>   DW_AT_name        : (strp) (offset: 0x3b1c): tp_methods
     <46e>   DW_AT_decl_file   : (data1) 12
     <46f>   DW_AT_decl_line   : (data1) 202
     <470>   DW_AT_decl_column : (data1) 18
     <471>   DW_AT_type        : (ref4) <0xdf6>
     <475>   DW_AT_data_member_location: (data1) 232
  <2><476>: Abbrev Number: 2 (DW_TAG_member)
-    <477>   DW_AT_name        : (strp) (offset: 0x237f): tp_members
+    <477>   DW_AT_name        : (strp) (offset: 0x2324): tp_members
     <47b>   DW_AT_decl_file   : (data1) 12
     <47c>   DW_AT_decl_line   : (data1) 203
     <47d>   DW_AT_decl_column : (data1) 18
     <47e>   DW_AT_type        : (ref4) <0xdfb>
     <482>   DW_AT_data_member_location: (data1) 240
  <2><483>: Abbrev Number: 2 (DW_TAG_member)
-    <484>   DW_AT_name        : (strp) (offset: 0x17ed): tp_getset
+    <484>   DW_AT_name        : (strp) (offset: 0x17a0): tp_getset
     <488>   DW_AT_decl_file   : (data1) 12
     <489>   DW_AT_decl_line   : (data1) 204
     <48a>   DW_AT_decl_column : (data1) 18
     <48b>   DW_AT_type        : (ref4) <0xe00>
     <48f>   DW_AT_data_member_location: (data1) 248
  <2><490>: Abbrev Number: 11 (DW_TAG_member)
-    <491>   DW_AT_name        : (strp) (offset: 0xebd): tp_base
+    <491>   DW_AT_name        : (strp) (offset: 0xe90): tp_base
     <495>   DW_AT_decl_file   : (implicit_const) 12
     <495>   DW_AT_decl_line   : (data1) 206
     <496>   DW_AT_decl_column : (data1) 19
     <497>   DW_AT_type        : (ref4) <0x6c8>
     <49b>   DW_AT_data_member_location: (data2) 256
  <2><49d>: Abbrev Number: 11 (DW_TAG_member)
-    <49e>   DW_AT_name        : (strp) (offset: 0x1587): tp_dict
+    <49e>   DW_AT_name        : (strp) (offset: 0x1556): tp_dict
     <4a2>   DW_AT_decl_file   : (implicit_const) 12
     <4a2>   DW_AT_decl_line   : (data1) 207
     <4a3>   DW_AT_decl_column : (data1) 15
     <4a4>   DW_AT_type        : (ref4) <0x62d>
     <4a8>   DW_AT_data_member_location: (data2) 264
  <2><4aa>: Abbrev Number: 11 (DW_TAG_member)
-    <4ab>   DW_AT_name        : (strp) (offset: 0x38bb): tp_descr_get
+    <4ab>   DW_AT_name        : (strp) (offset: 0x381c): tp_descr_get
     <4af>   DW_AT_decl_file   : (implicit_const) 12
     <4af>   DW_AT_decl_line   : (data1) 208
     <4b0>   DW_AT_decl_column : (data1) 18
     <4b1>   DW_AT_type        : (ref4) <0x9a5>, descrgetfunc
     <4b5>   DW_AT_data_member_location: (data2) 272
  <2><4b7>: Abbrev Number: 11 (DW_TAG_member)
-    <4b8>   DW_AT_name        : (strp) (offset: 0x14bb): tp_descr_set
+    <4b8>   DW_AT_name        : (strp) (offset: 0x148a): tp_descr_set
     <4bc>   DW_AT_decl_file   : (implicit_const) 12
     <4bc>   DW_AT_decl_line   : (data1) 209
     <4bd>   DW_AT_decl_column : (data1) 18
     <4be>   DW_AT_type        : (ref4) <0x9b1>, descrsetfunc
     <4c2>   DW_AT_data_member_location: (data2) 280
  <2><4c4>: Abbrev Number: 11 (DW_TAG_member)
-    <4c5>   DW_AT_name        : (strp) (offset: 0x3c93): tp_dictoffset
+    <4c5>   DW_AT_name        : (strp) (offset: 0x3bdc): tp_dictoffset
     <4c9>   DW_AT_decl_file   : (implicit_const) 12
     <4c9>   DW_AT_decl_line   : (data1) 210
     <4ca>   DW_AT_decl_column : (data1) 16
     <4cb>   DW_AT_type        : (ref4) <0xc8>, Py_ssize_t, ssize_t, __ssize_t, long int
     <4cf>   DW_AT_data_member_location: (data2) 288
  <2><4d1>: Abbrev Number: 11 (DW_TAG_member)
-    <4d2>   DW_AT_name        : (strp) (offset: 0x5d8): tp_init
+    <4d2>   DW_AT_name        : (strp) (offset: 0x5b6): tp_init
     <4d6>   DW_AT_decl_file   : (implicit_const) 12
     <4d6>   DW_AT_decl_line   : (data1) 211
     <4d7>   DW_AT_decl_column : (data1) 14
     <4d8>   DW_AT_type        : (ref4) <0x9bd>, initproc
     <4dc>   DW_AT_data_member_location: (data2) 296
  <2><4de>: Abbrev Number: 11 (DW_TAG_member)
-    <4df>   DW_AT_name        : (strp) (offset: 0x2add): tp_alloc
+    <4df>   DW_AT_name        : (strp) (offset: 0x2a83): tp_alloc
     <4e3>   DW_AT_decl_file   : (implicit_const) 12
     <4e3>   DW_AT_decl_line   : (data1) 212
     <4e4>   DW_AT_decl_column : (data1) 15
     <4e5>   DW_AT_type        : (ref4) <0x9f3>, allocfunc
     <4e9>   DW_AT_data_member_location: (data2) 304
  <2><4eb>: Abbrev Number: 11 (DW_TAG_member)
-    <4ec>   DW_AT_name        : (strp) (offset: 0x375c): tp_new
+    <4ec>   DW_AT_name        : (strp) (offset: 0x36bd): tp_new
     <4f0>   DW_AT_decl_file   : (implicit_const) 12
     <4f0>   DW_AT_decl_line   : (data1) 213
     <4f1>   DW_AT_decl_column : (data1) 13
     <4f2>   DW_AT_type        : (ref4) <0x9c9>, newfunc
     <4f6>   DW_AT_data_member_location: (data2) 312
  <2><4f8>: Abbrev Number: 11 (DW_TAG_member)
-    <4f9>   DW_AT_name        : (strp) (offset: 0xdf7): tp_free
+    <4f9>   DW_AT_name        : (strp) (offset: 0xdca): tp_free
     <4fd>   DW_AT_decl_file   : (implicit_const) 12
     <4fd>   DW_AT_decl_line   : (data1) 214
     <4fe>   DW_AT_decl_column : (data1) 14
     <4ff>   DW_AT_type        : (ref4) <0x898>, freefunc
     <503>   DW_AT_data_member_location: (data2) 320
  <2><505>: Abbrev Number: 11 (DW_TAG_member)
-    <506>   DW_AT_name        : (strp) (offset: 0x58c): tp_is_gc
+    <506>   DW_AT_name        : (strp) (offset: 0x56a): tp_is_gc
     <50a>   DW_AT_decl_file   : (implicit_const) 12
     <50a>   DW_AT_decl_line   : (data1) 215
     <50b>   DW_AT_decl_column : (data1) 13
     <50c>   DW_AT_type        : (ref4) <0x76b>, inquiry
     <510>   DW_AT_data_member_location: (data2) 328
  <2><512>: Abbrev Number: 11 (DW_TAG_member)
-    <513>   DW_AT_name        : (strp) (offset: 0x3c0f): tp_bases
+    <513>   DW_AT_name        : (strp) (offset: 0x3b58): tp_bases
     <517>   DW_AT_decl_file   : (implicit_const) 12
     <517>   DW_AT_decl_line   : (data1) 216
     <518>   DW_AT_decl_column : (data1) 15
     <519>   DW_AT_type        : (ref4) <0x62d>
     <51d>   DW_AT_data_member_location: (data2) 336
  <2><51f>: Abbrev Number: 11 (DW_TAG_member)
-    <520>   DW_AT_name        : (strp) (offset: 0x7de): tp_mro
+    <520>   DW_AT_name        : (strp) (offset: 0x7bc): tp_mro
     <524>   DW_AT_decl_file   : (implicit_const) 12
     <524>   DW_AT_decl_line   : (data1) 217
     <525>   DW_AT_decl_column : (data1) 15
     <526>   DW_AT_type        : (ref4) <0x62d>
     <52a>   DW_AT_data_member_location: (data2) 344
  <2><52c>: Abbrev Number: 11 (DW_TAG_member)
-    <52d>   DW_AT_name        : (strp) (offset: 0x302a): tp_cache
+    <52d>   DW_AT_name        : (strp) (offset: 0x2fbd): tp_cache
     <531>   DW_AT_decl_file   : (implicit_const) 12
     <531>   DW_AT_decl_line   : (data1) 218
     <532>   DW_AT_decl_column : (data1) 15
     <533>   DW_AT_type        : (ref4) <0x62d>
     <537>   DW_AT_data_member_location: (data2) 352
  <2><539>: Abbrev Number: 11 (DW_TAG_member)
-    <53a>   DW_AT_name        : (strp) (offset: 0xc2d): tp_subclasses
+    <53a>   DW_AT_name        : (strp) (offset: 0xc14): tp_subclasses
     <53e>   DW_AT_decl_file   : (implicit_const) 12
     <53e>   DW_AT_decl_line   : (data1) 219
     <53f>   DW_AT_decl_column : (data1) 11
     <540>   DW_AT_type        : (ref4) <0x96>
     <544>   DW_AT_data_member_location: (data2) 360
  <2><546>: Abbrev Number: 11 (DW_TAG_member)
-    <547>   DW_AT_name        : (strp) (offset: 0x2d3f): tp_weaklist
+    <547>   DW_AT_name        : (strp) (offset: 0x2cd2): tp_weaklist
     <54b>   DW_AT_decl_file   : (implicit_const) 12
     <54b>   DW_AT_decl_line   : (data1) 220
     <54c>   DW_AT_decl_column : (data1) 15
     <54d>   DW_AT_type        : (ref4) <0x62d>
     <551>   DW_AT_data_member_location: (data2) 368
  <2><553>: Abbrev Number: 11 (DW_TAG_member)
-    <554>   DW_AT_name        : (strp) (offset: 0x368c): tp_del
+    <554>   DW_AT_name        : (strp) (offset: 0x35ed): tp_del
     <558>   DW_AT_decl_file   : (implicit_const) 12
     <558>   DW_AT_decl_line   : (data1) 221
     <559>   DW_AT_decl_column : (data1) 16
     <55a>   DW_AT_type        : (ref4) <0x8b4>, destructor
     <55e>   DW_AT_data_member_location: (data2) 376
  <2><560>: Abbrev Number: 11 (DW_TAG_member)
-    <561>   DW_AT_name        : (strp) (offset: 0x2f62): tp_version_tag
+    <561>   DW_AT_name        : (strp) (offset: 0x2ef5): tp_version_tag
     <565>   DW_AT_decl_file   : (implicit_const) 12
     <565>   DW_AT_decl_line   : (data1) 224
     <566>   DW_AT_decl_column : (data1) 18
     <567>   DW_AT_type        : (ref4) <0x75>, unsigned int
     <56b>   DW_AT_data_member_location: (data2) 384
  <2><56d>: Abbrev Number: 11 (DW_TAG_member)
-    <56e>   DW_AT_name        : (strp) (offset: 0x3519): tp_finalize
+    <56e>   DW_AT_name        : (strp) (offset: 0x347a): tp_finalize
     <572>   DW_AT_decl_file   : (implicit_const) 12
     <572>   DW_AT_decl_line   : (data1) 226
     <573>   DW_AT_decl_column : (data1) 16
     <574>   DW_AT_type        : (ref4) <0x8b4>, destructor
     <578>   DW_AT_data_member_location: (data2) 392
  <2><57a>: Abbrev Number: 11 (DW_TAG_member)
-    <57b>   DW_AT_name        : (strp) (offset: 0x2e08): tp_vectorcall
+    <57b>   DW_AT_name        : (strp) (offset: 0x2d9b): tp_vectorcall
     <57f>   DW_AT_decl_file   : (implicit_const) 12
     <57f>   DW_AT_decl_line   : (data1) 227
     <580>   DW_AT_decl_column : (data1) 20
     <581>   DW_AT_type        : (ref4) <0xa18>, vectorcallfunc
     <585>   DW_AT_data_member_location: (data2) 400
  <2><587>: Abbrev Number: 11 (DW_TAG_member)
-    <588>   DW_AT_name        : (strp) (offset: 0x3681): tp_watched
+    <588>   DW_AT_name        : (strp) (offset: 0x35e2): tp_watched
     <58c>   DW_AT_decl_file   : (implicit_const) 12
     <58c>   DW_AT_decl_line   : (data1) 230
     <58d>   DW_AT_decl_column : (data1) 19
     <58e>   DW_AT_type        : (ref4) <0x6e>, unsigned char
     <592>   DW_AT_data_member_location: (data2) 408
  <2><594>: Abbrev Number: 0
  <1><595>: Abbrev Number: 20 (DW_TAG_structure_type)
@@ -783,64 +783,64 @@
     <5b8>   DW_AT_name        : (string) len
     <5bc>   DW_AT_decl_file   : (data1) 13
     <5bd>   DW_AT_decl_line   : (data1) 23
     <5be>   DW_AT_decl_column : (data1) 16
     <5bf>   DW_AT_type        : (ref4) <0xc8>, Py_ssize_t, ssize_t, __ssize_t, long int
     <5c3>   DW_AT_data_member_location: (data1) 16
  <2><5c4>: Abbrev Number: 2 (DW_TAG_member)
-    <5c5>   DW_AT_name        : (strp) (offset: 0x3134): itemsize
+    <5c5>   DW_AT_name        : (strp) (offset: 0x30c7): itemsize
     <5c9>   DW_AT_decl_file   : (data1) 13
     <5ca>   DW_AT_decl_line   : (data1) 24
     <5cb>   DW_AT_decl_column : (data1) 16
     <5cc>   DW_AT_type        : (ref4) <0xc8>, Py_ssize_t, ssize_t, __ssize_t, long int
     <5d0>   DW_AT_data_member_location: (data1) 24
  <2><5d1>: Abbrev Number: 2 (DW_TAG_member)
-    <5d2>   DW_AT_name        : (strp) (offset: 0x1cd7): readonly
+    <5d2>   DW_AT_name        : (strp) (offset: 0x1c8a): readonly
     <5d6>   DW_AT_decl_file   : (data1) 13
     <5d7>   DW_AT_decl_line   : (data1) 26
     <5d8>   DW_AT_decl_column : (data1) 9
     <5d9>   DW_AT_type        : (ref4) <0x41>, int
     <5dd>   DW_AT_data_member_location: (data1) 32
  <2><5de>: Abbrev Number: 2 (DW_TAG_member)
-    <5df>   DW_AT_name        : (strp) (offset: 0xfe9): ndim
+    <5df>   DW_AT_name        : (strp) (offset: 0xfbc): ndim
     <5e3>   DW_AT_decl_file   : (data1) 13
     <5e4>   DW_AT_decl_line   : (data1) 27
     <5e5>   DW_AT_decl_column : (data1) 9
     <5e6>   DW_AT_type        : (ref4) <0x41>, int
     <5ea>   DW_AT_data_member_location: (data1) 36
  <2><5eb>: Abbrev Number: 2 (DW_TAG_member)
-    <5ec>   DW_AT_name        : (strp) (offset: 0x1978): format
+    <5ec>   DW_AT_name        : (strp) (offset: 0x192b): format
     <5f0>   DW_AT_decl_file   : (data1) 13
     <5f1>   DW_AT_decl_line   : (data1) 28
     <5f2>   DW_AT_decl_column : (data1) 11
     <5f3>   DW_AT_type        : (ref4) <0xa4>
     <5f7>   DW_AT_data_member_location: (data1) 40
  <2><5f8>: Abbrev Number: 2 (DW_TAG_member)
-    <5f9>   DW_AT_name        : (strp) (offset: 0x355d): shape
+    <5f9>   DW_AT_name        : (strp) (offset: 0x34be): shape
     <5fd>   DW_AT_decl_file   : (data1) 13
     <5fe>   DW_AT_decl_line   : (data1) 29
     <5ff>   DW_AT_decl_column : (data1) 17
     <600>   DW_AT_type        : (ref4) <0x637>
     <604>   DW_AT_data_member_location: (data1) 48
  <2><605>: Abbrev Number: 2 (DW_TAG_member)
-    <606>   DW_AT_name        : (strp) (offset: 0xa1c): strides
+    <606>   DW_AT_name        : (strp) (offset: 0xa03): strides
     <60a>   DW_AT_decl_file   : (data1) 13
     <60b>   DW_AT_decl_line   : (data1) 30
     <60c>   DW_AT_decl_column : (data1) 17
     <60d>   DW_AT_type        : (ref4) <0x637>
     <611>   DW_AT_data_member_location: (data1) 56
  <2><612>: Abbrev Number: 2 (DW_TAG_member)
-    <613>   DW_AT_name        : (strp) (offset: 0x21b5): suboffsets
+    <613>   DW_AT_name        : (strp) (offset: 0x215a): suboffsets
     <617>   DW_AT_decl_file   : (data1) 13
     <618>   DW_AT_decl_line   : (data1) 31
     <619>   DW_AT_decl_column : (data1) 17
     <61a>   DW_AT_type        : (ref4) <0x637>
     <61e>   DW_AT_data_member_location: (data1) 64
  <2><61f>: Abbrev Number: 2 (DW_TAG_member)
-    <620>   DW_AT_name        : (strp) (offset: 0x1f0e): internal
+    <620>   DW_AT_name        : (strp) (offset: 0x1ec1): internal
     <624>   DW_AT_decl_file   : (data1) 13
     <625>   DW_AT_decl_line   : (data1) 32
     <626>   DW_AT_decl_column : (data1) 11
     <627>   DW_AT_type        : (ref4) <0x96>
     <62b>   DW_AT_data_member_location: (data1) 72
  <2><62c>: Abbrev Number: 0
  <1><62d>: Abbrev Number: 8 (DW_TAG_pointer_type)
@@ -848,21 +848,21 @@
     <62e>   DW_AT_type        : (ref4) <0x2c3>, PyObject, _object
  <1><632>: Abbrev Number: 22 (DW_TAG_const_type)
     <633>   DW_AT_type        : (ref4) <0x62d>
  <1><637>: Abbrev Number: 8 (DW_TAG_pointer_type)
     <638>   DW_AT_byte_size   : (implicit_const) 8
     <638>   DW_AT_type        : (ref4) <0xc8>, Py_ssize_t, ssize_t, __ssize_t, long int
  <1><63c>: Abbrev Number: 10 (DW_TAG_typedef)
-    <63d>   DW_AT_name        : (strp) (offset: 0xe28): Py_buffer
+    <63d>   DW_AT_name        : (strp) (offset: 0xdfb): Py_buffer
     <641>   DW_AT_decl_file   : (data1) 13
     <642>   DW_AT_decl_line   : (data1) 33
     <643>   DW_AT_decl_column : (data1) 3
     <644>   DW_AT_type        : (ref4) <0x595>
  <1><648>: Abbrev Number: 10 (DW_TAG_typedef)
-    <649>   DW_AT_name        : (strp) (offset: 0x4d5): getbufferproc
+    <649>   DW_AT_name        : (strp) (offset: 0x4b3): getbufferproc
     <64d>   DW_AT_decl_file   : (data1) 13
     <64e>   DW_AT_decl_line   : (data1) 35
     <64f>   DW_AT_decl_column : (data1) 15
     <650>   DW_AT_type        : (ref4) <0x654>
  <1><654>: Abbrev Number: 8 (DW_TAG_pointer_type)
     <655>   DW_AT_byte_size   : (implicit_const) 8
     <655>   DW_AT_type        : (ref4) <0x659>, int
@@ -877,15 +877,15 @@
  <2><66c>: Abbrev Number: 3 (DW_TAG_formal_parameter)
     <66d>   DW_AT_type        : (ref4) <0x41>, int
  <2><671>: Abbrev Number: 0
  <1><672>: Abbrev Number: 8 (DW_TAG_pointer_type)
     <673>   DW_AT_byte_size   : (implicit_const) 8
     <673>   DW_AT_type        : (ref4) <0x63c>, Py_buffer
  <1><677>: Abbrev Number: 10 (DW_TAG_typedef)
-    <678>   DW_AT_name        : (strp) (offset: 0x536): releasebufferproc
+    <678>   DW_AT_name        : (strp) (offset: 0x514): releasebufferproc
     <67c>   DW_AT_decl_file   : (data1) 13
     <67d>   DW_AT_decl_line   : (data1) 36
     <67e>   DW_AT_decl_column : (data1) 16
     <67f>   DW_AT_type        : (ref4) <0x683>
  <1><683>: Abbrev Number: 8 (DW_TAG_pointer_type)
     <684>   DW_AT_byte_size   : (implicit_const) 8
     <684>   DW_AT_type        : (ref4) <0x688>
@@ -900,21 +900,21 @@
  <1><698>: Abbrev Number: 32 (DW_TAG_union_type)
     <699>   DW_AT_byte_size   : (data1) 8
     <69a>   DW_AT_decl_file   : (data1) 11
     <69b>   DW_AT_decl_line   : (data1) 180
     <69c>   DW_AT_decl_column : (data1) 5
     <69d>   DW_AT_sibling     : (ref4) <0x6b8>
  <2><6a1>: Abbrev Number: 24 (DW_TAG_member)
-    <6a2>   DW_AT_name        : (strp) (offset: 0x868): ob_refcnt
+    <6a2>   DW_AT_name        : (strp) (offset: 0x846): ob_refcnt
     <6a6>   DW_AT_decl_file   : (implicit_const) 11
     <6a6>   DW_AT_decl_line   : (data1) 181
     <6a7>   DW_AT_decl_column : (data1) 19
     <6a8>   DW_AT_type        : (ref4) <0xc8>, Py_ssize_t, ssize_t, __ssize_t, long int
  <2><6ac>: Abbrev Number: 24 (DW_TAG_member)
-    <6ad>   DW_AT_name        : (strp) (offset: 0x38c8): ob_refcnt_split
+    <6ad>   DW_AT_name        : (strp) (offset: 0x3829): ob_refcnt_split
     <6b1>   DW_AT_decl_file   : (implicit_const) 11
     <6b1>   DW_AT_decl_line   : (data1) 183
     <6b2>   DW_AT_decl_column : (data1) 20
     <6b3>   DW_AT_type        : (ref4) <0x6b8>, uint32_t, __uint32_t, unsigned int
  <2><6b7>: Abbrev Number: 0
  <1><6b8>: Abbrev Number: 13 (DW_TAG_array_type)
     <6b9>   DW_AT_type        : (ref4) <0xbc>, uint32_t, __uint32_t, unsigned int
@@ -929,36 +929,36 @@
  <1><6cd>: Abbrev Number: 20 (DW_TAG_structure_type)
     <6ce>   DW_AT_byte_size   : (data1) 24
     <6cf>   DW_AT_decl_file   : (data1) 11
     <6d0>   DW_AT_decl_line   : (data1) 196
     <6d1>   DW_AT_decl_column : (implicit_const) 9
     <6d1>   DW_AT_sibling     : (ref4) <0x6f0>
  <2><6d5>: Abbrev Number: 2 (DW_TAG_member)
-    <6d6>   DW_AT_name        : (strp) (offset: 0x5be): ob_base
+    <6d6>   DW_AT_name        : (strp) (offset: 0x59c): ob_base
     <6da>   DW_AT_decl_file   : (data1) 11
     <6db>   DW_AT_decl_line   : (data1) 197
     <6dc>   DW_AT_decl_column : (data1) 14
     <6dd>   DW_AT_type        : (ref4) <0x2c3>, PyObject, _object
     <6e1>   DW_AT_data_member_location: (data1) 0
  <2><6e2>: Abbrev Number: 2 (DW_TAG_member)
-    <6e3>   DW_AT_name        : (strp) (offset: 0x1f50): ob_size
+    <6e3>   DW_AT_name        : (strp) (offset: 0x1f03): ob_size
     <6e7>   DW_AT_decl_file   : (data1) 11
     <6e8>   DW_AT_decl_line   : (data1) 198
     <6e9>   DW_AT_decl_column : (data1) 16
     <6ea>   DW_AT_type        : (ref4) <0xc8>, Py_ssize_t, ssize_t, __ssize_t, long int
     <6ee>   DW_AT_data_member_location: (data1) 16
  <2><6ef>: Abbrev Number: 0
  <1><6f0>: Abbrev Number: 10 (DW_TAG_typedef)
-    <6f1>   DW_AT_name        : (strp) (offset: 0x13e2): PyVarObject
+    <6f1>   DW_AT_name        : (strp) (offset: 0x13b1): PyVarObject
     <6f5>   DW_AT_decl_file   : (data1) 11
     <6f6>   DW_AT_decl_line   : (data1) 199
     <6f7>   DW_AT_decl_column : (data1) 3
     <6f8>   DW_AT_type        : (ref4) <0x6cd>
  <1><6fc>: Abbrev Number: 9 (DW_TAG_typedef)
-    <6fd>   DW_AT_name        : (strp) (offset: 0x1410): unaryfunc
+    <6fd>   DW_AT_name        : (strp) (offset: 0x13df): unaryfunc
     <701>   DW_AT_decl_file   : (implicit_const) 11
     <701>   DW_AT_decl_line   : (data2) 305
     <703>   DW_AT_decl_column : (data1) 22
     <704>   DW_AT_type        : (ref4) <0x708>
  <1><708>: Abbrev Number: 8 (DW_TAG_pointer_type)
     <709>   DW_AT_byte_size   : (implicit_const) 8
     <709>   DW_AT_type        : (ref4) <0x70d>
@@ -966,15 +966,15 @@
     <70e>   DW_AT_prototyped  : (flag_present) 1
     <70e>   DW_AT_type        : (ref4) <0x62d>
     <712>   DW_AT_sibling     : (ref4) <0x71c>
  <2><716>: Abbrev Number: 3 (DW_TAG_formal_parameter)
     <717>   DW_AT_type        : (ref4) <0x62d>
  <2><71b>: Abbrev Number: 0
  <1><71c>: Abbrev Number: 9 (DW_TAG_typedef)
-    <71d>   DW_AT_name        : (strp) (offset: 0x3063): binaryfunc
+    <71d>   DW_AT_name        : (strp) (offset: 0x2ff6): binaryfunc
     <721>   DW_AT_decl_file   : (implicit_const) 11
     <721>   DW_AT_decl_line   : (data2) 306
     <723>   DW_AT_decl_column : (data1) 22
     <724>   DW_AT_type        : (ref4) <0x728>
  <1><728>: Abbrev Number: 8 (DW_TAG_pointer_type)
     <729>   DW_AT_byte_size   : (implicit_const) 8
     <729>   DW_AT_type        : (ref4) <0x72d>
@@ -984,15 +984,15 @@
     <732>   DW_AT_sibling     : (ref4) <0x741>
  <2><736>: Abbrev Number: 3 (DW_TAG_formal_parameter)
     <737>   DW_AT_type        : (ref4) <0x62d>
  <2><73b>: Abbrev Number: 3 (DW_TAG_formal_parameter)
     <73c>   DW_AT_type        : (ref4) <0x62d>
  <2><740>: Abbrev Number: 0
  <1><741>: Abbrev Number: 9 (DW_TAG_typedef)
-    <742>   DW_AT_name        : (strp) (offset: 0x806): ternaryfunc
+    <742>   DW_AT_name        : (strp) (offset: 0x7e4): ternaryfunc
     <746>   DW_AT_decl_file   : (implicit_const) 11
     <746>   DW_AT_decl_line   : (data2) 307
     <748>   DW_AT_decl_column : (data1) 22
     <749>   DW_AT_type        : (ref4) <0x74d>
  <1><74d>: Abbrev Number: 8 (DW_TAG_pointer_type)
     <74e>   DW_AT_byte_size   : (implicit_const) 8
     <74e>   DW_AT_type        : (ref4) <0x752>
@@ -1004,15 +1004,15 @@
     <75c>   DW_AT_type        : (ref4) <0x62d>
  <2><760>: Abbrev Number: 3 (DW_TAG_formal_parameter)
     <761>   DW_AT_type        : (ref4) <0x62d>
  <2><765>: Abbrev Number: 3 (DW_TAG_formal_parameter)
     <766>   DW_AT_type        : (ref4) <0x62d>
  <2><76a>: Abbrev Number: 0
  <1><76b>: Abbrev Number: 9 (DW_TAG_typedef)
-    <76c>   DW_AT_name        : (strp) (offset: 0x2124): inquiry
+    <76c>   DW_AT_name        : (strp) (offset: 0x20c9): inquiry
     <770>   DW_AT_decl_file   : (implicit_const) 11
     <770>   DW_AT_decl_line   : (data2) 308
     <772>   DW_AT_decl_column : (data1) 15
     <773>   DW_AT_type        : (ref4) <0x777>
  <1><777>: Abbrev Number: 8 (DW_TAG_pointer_type)
     <778>   DW_AT_byte_size   : (implicit_const) 8
     <778>   DW_AT_type        : (ref4) <0x77c>, int
@@ -1020,15 +1020,15 @@
     <77d>   DW_AT_prototyped  : (flag_present) 1
     <77d>   DW_AT_type        : (ref4) <0x41>, int
     <781>   DW_AT_sibling     : (ref4) <0x78b>
  <2><785>: Abbrev Number: 3 (DW_TAG_formal_parameter)
     <786>   DW_AT_type        : (ref4) <0x62d>
  <2><78a>: Abbrev Number: 0
  <1><78b>: Abbrev Number: 9 (DW_TAG_typedef)
-    <78c>   DW_AT_name        : (strp) (offset: 0x14f1): lenfunc
+    <78c>   DW_AT_name        : (strp) (offset: 0x14c0): lenfunc
     <790>   DW_AT_decl_file   : (implicit_const) 11
     <790>   DW_AT_decl_line   : (data2) 309
     <792>   DW_AT_decl_column : (data1) 22
     <793>   DW_AT_type        : (ref4) <0x797>
  <1><797>: Abbrev Number: 8 (DW_TAG_pointer_type)
     <798>   DW_AT_byte_size   : (implicit_const) 8
     <798>   DW_AT_type        : (ref4) <0x79c>, Py_ssize_t, ssize_t, __ssize_t, long int
@@ -1036,15 +1036,15 @@
     <79d>   DW_AT_prototyped  : (flag_present) 1
     <79d>   DW_AT_type        : (ref4) <0xc8>, Py_ssize_t, ssize_t, __ssize_t, long int
     <7a1>   DW_AT_sibling     : (ref4) <0x7ab>
  <2><7a5>: Abbrev Number: 3 (DW_TAG_formal_parameter)
     <7a6>   DW_AT_type        : (ref4) <0x62d>
  <2><7aa>: Abbrev Number: 0
  <1><7ab>: Abbrev Number: 9 (DW_TAG_typedef)
-    <7ac>   DW_AT_name        : (strp) (offset: 0x1ce0): ssizeargfunc
+    <7ac>   DW_AT_name        : (strp) (offset: 0x1c93): ssizeargfunc
     <7b0>   DW_AT_decl_file   : (implicit_const) 11
     <7b0>   DW_AT_decl_line   : (data2) 310
     <7b2>   DW_AT_decl_column : (data1) 21
     <7b3>   DW_AT_type        : (ref4) <0x7b7>
  <1><7b7>: Abbrev Number: 8 (DW_TAG_pointer_type)
     <7b8>   DW_AT_byte_size   : (implicit_const) 8
     <7b8>   DW_AT_type        : (ref4) <0x7bc>
@@ -1054,15 +1054,15 @@
     <7c1>   DW_AT_sibling     : (ref4) <0x7d0>
  <2><7c5>: Abbrev Number: 3 (DW_TAG_formal_parameter)
     <7c6>   DW_AT_type        : (ref4) <0x62d>
  <2><7ca>: Abbrev Number: 3 (DW_TAG_formal_parameter)
     <7cb>   DW_AT_type        : (ref4) <0xc8>, Py_ssize_t, ssize_t, __ssize_t, long int
  <2><7cf>: Abbrev Number: 0
  <1><7d0>: Abbrev Number: 9 (DW_TAG_typedef)
-    <7d1>   DW_AT_name        : (strp) (offset: 0x3410): ssizeobjargproc
+    <7d1>   DW_AT_name        : (strp) (offset: 0x3385): ssizeobjargproc
     <7d5>   DW_AT_decl_file   : (implicit_const) 11
     <7d5>   DW_AT_decl_line   : (data2) 312
     <7d7>   DW_AT_decl_column : (data1) 14
     <7d8>   DW_AT_type        : (ref4) <0x7dc>
  <1><7dc>: Abbrev Number: 8 (DW_TAG_pointer_type)
     <7dd>   DW_AT_byte_size   : (implicit_const) 8
     <7dd>   DW_AT_type        : (ref4) <0x7e1>, int
@@ -1074,15 +1074,15 @@
     <7eb>   DW_AT_type        : (ref4) <0x62d>
  <2><7ef>: Abbrev Number: 3 (DW_TAG_formal_parameter)
     <7f0>   DW_AT_type        : (ref4) <0xc8>, Py_ssize_t, ssize_t, __ssize_t, long int
  <2><7f4>: Abbrev Number: 3 (DW_TAG_formal_parameter)
     <7f5>   DW_AT_type        : (ref4) <0x62d>
  <2><7f9>: Abbrev Number: 0
  <1><7fa>: Abbrev Number: 9 (DW_TAG_typedef)
-    <7fb>   DW_AT_name        : (strp) (offset: 0x238a): objobjargproc
+    <7fb>   DW_AT_name        : (strp) (offset: 0x232f): objobjargproc
     <7ff>   DW_AT_decl_file   : (implicit_const) 11
     <7ff>   DW_AT_decl_line   : (data2) 314
     <801>   DW_AT_decl_column : (data1) 14
     <802>   DW_AT_type        : (ref4) <0x806>
  <1><806>: Abbrev Number: 8 (DW_TAG_pointer_type)
     <807>   DW_AT_byte_size   : (implicit_const) 8
     <807>   DW_AT_type        : (ref4) <0x80b>, int
@@ -1112,15 +1112,15 @@
     <83a>   DW_AT_sibling     : (ref4) <0x849>
  <2><83e>: Abbrev Number: 3 (DW_TAG_formal_parameter)
     <83f>   DW_AT_type        : (ref4) <0x62d>
  <2><843>: Abbrev Number: 3 (DW_TAG_formal_parameter)
     <844>   DW_AT_type        : (ref4) <0x62d>
  <2><848>: Abbrev Number: 0
  <1><849>: Abbrev Number: 9 (DW_TAG_typedef)
-    <84a>   DW_AT_name        : (strp) (offset: 0x1be0): visitproc
+    <84a>   DW_AT_name        : (strp) (offset: 0x1b93): visitproc
     <84e>   DW_AT_decl_file   : (implicit_const) 11
     <84e>   DW_AT_decl_line   : (data2) 317
     <850>   DW_AT_decl_column : (data1) 15
     <851>   DW_AT_type        : (ref4) <0x855>
  <1><855>: Abbrev Number: 8 (DW_TAG_pointer_type)
     <856>   DW_AT_byte_size   : (implicit_const) 8
     <856>   DW_AT_type        : (ref4) <0x85a>, int
@@ -1130,15 +1130,15 @@
     <85f>   DW_AT_sibling     : (ref4) <0x86e>
  <2><863>: Abbrev Number: 3 (DW_TAG_formal_parameter)
     <864>   DW_AT_type        : (ref4) <0x62d>
  <2><868>: Abbrev Number: 3 (DW_TAG_formal_parameter)
     <869>   DW_AT_type        : (ref4) <0x96>
  <2><86d>: Abbrev Number: 0
  <1><86e>: Abbrev Number: 9 (DW_TAG_typedef)
-    <86f>   DW_AT_name        : (strp) (offset: 0x1784): traverseproc
+    <86f>   DW_AT_name        : (strp) (offset: 0x1753): traverseproc
     <873>   DW_AT_decl_file   : (implicit_const) 11
     <873>   DW_AT_decl_line   : (data2) 318
     <875>   DW_AT_decl_column : (data1) 15
     <876>   DW_AT_type        : (ref4) <0x87a>
  <1><87a>: Abbrev Number: 8 (DW_TAG_pointer_type)
     <87b>   DW_AT_byte_size   : (implicit_const) 8
     <87b>   DW_AT_type        : (ref4) <0x87f>, int
@@ -1150,45 +1150,45 @@
     <889>   DW_AT_type        : (ref4) <0x62d>
  <2><88d>: Abbrev Number: 3 (DW_TAG_formal_parameter)
     <88e>   DW_AT_type        : (ref4) <0x849>, visitproc
  <2><892>: Abbrev Number: 3 (DW_TAG_formal_parameter)
     <893>   DW_AT_type        : (ref4) <0x96>
  <2><897>: Abbrev Number: 0
  <1><898>: Abbrev Number: 9 (DW_TAG_typedef)
-    <899>   DW_AT_name        : (strp) (offset: 0x2c08): freefunc
+    <899>   DW_AT_name        : (strp) (offset: 0x2b9b): freefunc
     <89d>   DW_AT_decl_file   : (implicit_const) 11
     <89d>   DW_AT_decl_line   : (data2) 321
     <89f>   DW_AT_decl_column : (data1) 16
     <8a0>   DW_AT_type        : (ref4) <0x8a4>
  <1><8a4>: Abbrev Number: 8 (DW_TAG_pointer_type)
     <8a5>   DW_AT_byte_size   : (implicit_const) 8
     <8a5>   DW_AT_type        : (ref4) <0x8a9>
  <1><8a9>: Abbrev Number: 23 (DW_TAG_subroutine_type)
     <8aa>   DW_AT_prototyped  : (flag_present) 1
     <8aa>   DW_AT_sibling     : (ref4) <0x8b4>
  <2><8ae>: Abbrev Number: 3 (DW_TAG_formal_parameter)
     <8af>   DW_AT_type        : (ref4) <0x96>
  <2><8b3>: Abbrev Number: 0
  <1><8b4>: Abbrev Number: 9 (DW_TAG_typedef)
-    <8b5>   DW_AT_name        : (strp) (offset: 0x36e9): destructor
+    <8b5>   DW_AT_name        : (strp) (offset: 0x364a): destructor
     <8b9>   DW_AT_decl_file   : (implicit_const) 11
     <8b9>   DW_AT_decl_line   : (data2) 322
     <8bb>   DW_AT_decl_column : (data1) 16
     <8bc>   DW_AT_type        : (ref4) <0x8c0>
  <1><8c0>: Abbrev Number: 8 (DW_TAG_pointer_type)
     <8c1>   DW_AT_byte_size   : (implicit_const) 8
     <8c1>   DW_AT_type        : (ref4) <0x8c5>
  <1><8c5>: Abbrev Number: 23 (DW_TAG_subroutine_type)
     <8c6>   DW_AT_prototyped  : (flag_present) 1
     <8c6>   DW_AT_sibling     : (ref4) <0x8d0>
  <2><8ca>: Abbrev Number: 3 (DW_TAG_formal_parameter)
     <8cb>   DW_AT_type        : (ref4) <0x62d>
  <2><8cf>: Abbrev Number: 0
  <1><8d0>: Abbrev Number: 9 (DW_TAG_typedef)
-    <8d1>   DW_AT_name        : (strp) (offset: 0x3cb8): getattrfunc
+    <8d1>   DW_AT_name        : (strp) (offset: 0x3c01): getattrfunc
     <8d5>   DW_AT_decl_file   : (implicit_const) 11
     <8d5>   DW_AT_decl_line   : (data2) 323
     <8d7>   DW_AT_decl_column : (data1) 21
     <8d8>   DW_AT_type        : (ref4) <0x8dc>
  <1><8dc>: Abbrev Number: 8 (DW_TAG_pointer_type)
     <8dd>   DW_AT_byte_size   : (implicit_const) 8
     <8dd>   DW_AT_type        : (ref4) <0x8e1>
@@ -1198,21 +1198,21 @@
     <8e6>   DW_AT_sibling     : (ref4) <0x8f5>
  <2><8ea>: Abbrev Number: 3 (DW_TAG_formal_parameter)
     <8eb>   DW_AT_type        : (ref4) <0x62d>
  <2><8ef>: Abbrev Number: 3 (DW_TAG_formal_parameter)
     <8f0>   DW_AT_type        : (ref4) <0xa4>
  <2><8f4>: Abbrev Number: 0
  <1><8f5>: Abbrev Number: 9 (DW_TAG_typedef)
-    <8f6>   DW_AT_name        : (strp) (offset: 0x12d5): getattrofunc
+    <8f6>   DW_AT_name        : (strp) (offset: 0x12a8): getattrofunc
     <8fa>   DW_AT_decl_file   : (implicit_const) 11
     <8fa>   DW_AT_decl_line   : (data2) 324
     <8fc>   DW_AT_decl_column : (data1) 21
     <8fd>   DW_AT_type        : (ref4) <0x728>
  <1><901>: Abbrev Number: 9 (DW_TAG_typedef)
-    <902>   DW_AT_name        : (strp) (offset: 0x23a3): setattrfunc
+    <902>   DW_AT_name        : (strp) (offset: 0x2348): setattrfunc
     <906>   DW_AT_decl_file   : (implicit_const) 11
     <906>   DW_AT_decl_line   : (data2) 325
     <908>   DW_AT_decl_column : (data1) 15
     <909>   DW_AT_type        : (ref4) <0x90d>
  <1><90d>: Abbrev Number: 8 (DW_TAG_pointer_type)
     <90e>   DW_AT_byte_size   : (implicit_const) 8
     <90e>   DW_AT_type        : (ref4) <0x912>, int
@@ -1224,27 +1224,27 @@
     <91c>   DW_AT_type        : (ref4) <0x62d>
  <2><920>: Abbrev Number: 3 (DW_TAG_formal_parameter)
     <921>   DW_AT_type        : (ref4) <0xa4>
  <2><925>: Abbrev Number: 3 (DW_TAG_formal_parameter)
     <926>   DW_AT_type        : (ref4) <0x62d>
  <2><92a>: Abbrev Number: 0
  <1><92b>: Abbrev Number: 9 (DW_TAG_typedef)
-    <92c>   DW_AT_name        : (strp) (offset: 0x3403): setattrofunc
+    <92c>   DW_AT_name        : (strp) (offset: 0x3378): setattrofunc
     <930>   DW_AT_decl_file   : (implicit_const) 11
     <930>   DW_AT_decl_line   : (data2) 326
     <932>   DW_AT_decl_column : (data1) 15
     <933>   DW_AT_type        : (ref4) <0x806>
  <1><937>: Abbrev Number: 9 (DW_TAG_typedef)
-    <938>   DW_AT_name        : (strp) (offset: 0x55e): reprfunc
+    <938>   DW_AT_name        : (strp) (offset: 0x53c): reprfunc
     <93c>   DW_AT_decl_file   : (implicit_const) 11
     <93c>   DW_AT_decl_line   : (data2) 327
     <93e>   DW_AT_decl_column : (data1) 21
     <93f>   DW_AT_type        : (ref4) <0x708>
  <1><943>: Abbrev Number: 9 (DW_TAG_typedef)
-    <944>   DW_AT_name        : (strp) (offset: 0x2ed1): hashfunc
+    <944>   DW_AT_name        : (strp) (offset: 0x2e64): hashfunc
     <948>   DW_AT_decl_file   : (implicit_const) 11
     <948>   DW_AT_decl_line   : (data2) 328
     <94a>   DW_AT_decl_column : (data1) 21
     <94b>   DW_AT_type        : (ref4) <0x94f>
  <1><94f>: Abbrev Number: 8 (DW_TAG_pointer_type)
     <950>   DW_AT_byte_size   : (implicit_const) 8
     <950>   DW_AT_type        : (ref4) <0x954>, Py_hash_t, Py_ssize_t, ssize_t, __ssize_t, long int
@@ -1252,15 +1252,15 @@
     <955>   DW_AT_prototyped  : (flag_present) 1
     <955>   DW_AT_type        : (ref4) <0xd4>, Py_hash_t, Py_ssize_t, ssize_t, __ssize_t, long int
     <959>   DW_AT_sibling     : (ref4) <0x963>
  <2><95d>: Abbrev Number: 3 (DW_TAG_formal_parameter)
     <95e>   DW_AT_type        : (ref4) <0x62d>
  <2><962>: Abbrev Number: 0
  <1><963>: Abbrev Number: 9 (DW_TAG_typedef)
-    <964>   DW_AT_name        : (strp) (offset: 0x2eb9): richcmpfunc
+    <964>   DW_AT_name        : (strp) (offset: 0x2e4c): richcmpfunc
     <968>   DW_AT_decl_file   : (implicit_const) 11
     <968>   DW_AT_decl_line   : (data2) 329
     <96a>   DW_AT_decl_column : (data1) 21
     <96b>   DW_AT_type        : (ref4) <0x96f>
  <1><96f>: Abbrev Number: 8 (DW_TAG_pointer_type)
     <970>   DW_AT_byte_size   : (implicit_const) 8
     <970>   DW_AT_type        : (ref4) <0x974>
@@ -1278,39 +1278,39 @@
  <1><98d>: Abbrev Number: 9 (DW_TAG_typedef)
     <98e>   DW_AT_name        : (strp) (offset: 0x161): getiterfunc
     <992>   DW_AT_decl_file   : (implicit_const) 11
     <992>   DW_AT_decl_line   : (data2) 330
     <994>   DW_AT_decl_column : (data1) 21
     <995>   DW_AT_type        : (ref4) <0x708>
  <1><999>: Abbrev Number: 9 (DW_TAG_typedef)
-    <99a>   DW_AT_name        : (strp) (offset: 0x2726): iternextfunc
+    <99a>   DW_AT_name        : (strp) (offset: 0x26cf): iternextfunc
     <99e>   DW_AT_decl_file   : (implicit_const) 11
     <99e>   DW_AT_decl_line   : (data2) 331
     <9a0>   DW_AT_decl_column : (data1) 21
     <9a1>   DW_AT_type        : (ref4) <0x708>
  <1><9a5>: Abbrev Number: 9 (DW_TAG_typedef)
-    <9a6>   DW_AT_name        : (strp) (offset: 0x27dc): descrgetfunc
+    <9a6>   DW_AT_name        : (strp) (offset: 0x2785): descrgetfunc
     <9aa>   DW_AT_decl_file   : (implicit_const) 11
     <9aa>   DW_AT_decl_line   : (data2) 332
     <9ac>   DW_AT_decl_column : (data1) 21
     <9ad>   DW_AT_type        : (ref4) <0x74d>
  <1><9b1>: Abbrev Number: 9 (DW_TAG_typedef)
-    <9b2>   DW_AT_name        : (strp) (offset: 0x3a33): descrsetfunc
+    <9b2>   DW_AT_name        : (strp) (offset: 0x397c): descrsetfunc
     <9b6>   DW_AT_decl_file   : (implicit_const) 11
     <9b6>   DW_AT_decl_line   : (data2) 333
     <9b8>   DW_AT_decl_column : (data1) 15
     <9b9>   DW_AT_type        : (ref4) <0x806>
  <1><9bd>: Abbrev Number: 9 (DW_TAG_typedef)
-    <9be>   DW_AT_name        : (strp) (offset: 0x2a56): initproc
+    <9be>   DW_AT_name        : (strp) (offset: 0x29fc): initproc
     <9c2>   DW_AT_decl_file   : (implicit_const) 11
     <9c2>   DW_AT_decl_line   : (data2) 334
     <9c4>   DW_AT_decl_column : (data1) 15
     <9c5>   DW_AT_type        : (ref4) <0x806>
  <1><9c9>: Abbrev Number: 9 (DW_TAG_typedef)
-    <9ca>   DW_AT_name        : (strp) (offset: 0x167e): newfunc
+    <9ca>   DW_AT_name        : (strp) (offset: 0x164d): newfunc
     <9ce>   DW_AT_decl_file   : (implicit_const) 11
     <9ce>   DW_AT_decl_line   : (data2) 335
     <9d0>   DW_AT_decl_column : (data1) 21
     <9d1>   DW_AT_type        : (ref4) <0x9d5>
  <1><9d5>: Abbrev Number: 8 (DW_TAG_pointer_type)
     <9d6>   DW_AT_byte_size   : (implicit_const) 8
     <9d6>   DW_AT_type        : (ref4) <0x9da>
@@ -1322,15 +1322,15 @@
     <9e4>   DW_AT_type        : (ref4) <0x6c8>
  <2><9e8>: Abbrev Number: 3 (DW_TAG_formal_parameter)
     <9e9>   DW_AT_type        : (ref4) <0x62d>
  <2><9ed>: Abbrev Number: 3 (DW_TAG_formal_parameter)
     <9ee>   DW_AT_type        : (ref4) <0x62d>
  <2><9f2>: Abbrev Number: 0
  <1><9f3>: Abbrev Number: 9 (DW_TAG_typedef)
-    <9f4>   DW_AT_name        : (strp) (offset: 0x1bb6): allocfunc
+    <9f4>   DW_AT_name        : (strp) (offset: 0x1b69): allocfunc
     <9f8>   DW_AT_decl_file   : (implicit_const) 11
     <9f8>   DW_AT_decl_line   : (data2) 336
     <9fa>   DW_AT_decl_column : (data1) 21
     <9fb>   DW_AT_type        : (ref4) <0x9ff>
  <1><9ff>: Abbrev Number: 8 (DW_TAG_pointer_type)
     <a00>   DW_AT_byte_size   : (implicit_const) 8
     <a00>   DW_AT_type        : (ref4) <0xa04>
@@ -1340,15 +1340,15 @@
     <a09>   DW_AT_sibling     : (ref4) <0xa18>
  <2><a0d>: Abbrev Number: 3 (DW_TAG_formal_parameter)
     <a0e>   DW_AT_type        : (ref4) <0x6c8>
  <2><a12>: Abbrev Number: 3 (DW_TAG_formal_parameter)
     <a13>   DW_AT_type        : (ref4) <0xc8>, Py_ssize_t, ssize_t, __ssize_t, long int
  <2><a17>: Abbrev Number: 0
  <1><a18>: Abbrev Number: 9 (DW_TAG_typedef)
-    <a19>   DW_AT_name        : (strp) (offset: 0x1e64): vectorcallfunc
+    <a19>   DW_AT_name        : (strp) (offset: 0x1e17): vectorcallfunc
     <a1d>   DW_AT_decl_file   : (implicit_const) 11
     <a1d>   DW_AT_decl_line   : (data2) 339
     <a1f>   DW_AT_decl_column : (data1) 21
     <a20>   DW_AT_type        : (ref4) <0xa24>
  <1><a24>: Abbrev Number: 8 (DW_TAG_pointer_type)
     <a25>   DW_AT_byte_size   : (implicit_const) 8
     <a25>   DW_AT_type        : (ref4) <0xa29>
@@ -1364,422 +1364,422 @@
     <a3d>   DW_AT_type        : (ref4) <0x2e>, size_t, long unsigned int
  <2><a41>: Abbrev Number: 3 (DW_TAG_formal_parameter)
     <a42>   DW_AT_type        : (ref4) <0x62d>
  <2><a46>: Abbrev Number: 0
  <1><a47>: Abbrev Number: 8 (DW_TAG_pointer_type)
     <a48>   DW_AT_byte_size   : (implicit_const) 8
     <a48>   DW_AT_type        : (ref4) <0x632>
- <1><a4c>: Abbrev Number: 7 (DW_TAG_enumeration_type)
+ <1><a4c>: Abbrev Number: 6 (DW_TAG_enumeration_type)
     <a4d>   DW_AT_encoding    : (data1) 5	(signed)
     <a4e>   DW_AT_byte_size   : (implicit_const) 4
     <a4e>   DW_AT_type        : (ref4) <0x41>, int
     <a52>   DW_AT_decl_file   : (data1) 11
     <a53>   DW_AT_decl_line   : (data2) 873
     <a55>   DW_AT_decl_column : (data1) 14
     <a56>   DW_AT_sibling     : (ref4) <0xa6c>
  <2><a5a>: Abbrev Number: 1 (DW_TAG_enumerator)
-    <a5b>   DW_AT_name        : (strp) (offset: 0x5fb): PYGEN_RETURN
+    <a5b>   DW_AT_name        : (strp) (offset: 0x5d9): PYGEN_RETURN
     <a5f>   DW_AT_const_value : (data1) 0
  <2><a60>: Abbrev Number: 25 (DW_TAG_enumerator)
-    <a61>   DW_AT_name        : (strp) (offset: 0x16a4): PYGEN_ERROR
+    <a61>   DW_AT_name        : (strp) (offset: 0x1673): PYGEN_ERROR
     <a65>   DW_AT_const_value : (implicit_const) -1
  <2><a65>: Abbrev Number: 1 (DW_TAG_enumerator)
-    <a66>   DW_AT_name        : (strp) (offset: 0x17b2): PYGEN_NEXT
+    <a66>   DW_AT_name        : (strp) (offset: 0x1781): PYGEN_NEXT
     <a6a>   DW_AT_const_value : (data1) 1
  <2><a6b>: Abbrev Number: 0
  <1><a6c>: Abbrev Number: 9 (DW_TAG_typedef)
-    <a6d>   DW_AT_name        : (strp) (offset: 0xbf4): PySendResult
+    <a6d>   DW_AT_name        : (strp) (offset: 0xbdb): PySendResult
     <a71>   DW_AT_decl_file   : (implicit_const) 11
     <a71>   DW_AT_decl_line   : (data2) 877
     <a73>   DW_AT_decl_column : (data1) 3
     <a74>   DW_AT_type        : (ref4) <0xa4c>
  <1><a78>: Abbrev Number: 33 (DW_TAG_structure_type)
     <a79>   DW_AT_byte_size   : (data2) 288
     <a7b>   DW_AT_decl_file   : (data1) 12
     <a7c>   DW_AT_decl_line   : (data1) 59
     <a7d>   DW_AT_decl_column : (data1) 9
     <a7e>   DW_AT_sibling     : (ref4) <0xc57>
  <2><a82>: Abbrev Number: 2 (DW_TAG_member)
-    <a83>   DW_AT_name        : (strp) (offset: 0x4ff): nb_add
+    <a83>   DW_AT_name        : (strp) (offset: 0x4dd): nb_add
     <a87>   DW_AT_decl_file   : (data1) 12
     <a88>   DW_AT_decl_line   : (data1) 64
     <a89>   DW_AT_decl_column : (data1) 16
     <a8a>   DW_AT_type        : (ref4) <0x71c>, binaryfunc
     <a8e>   DW_AT_data_member_location: (data1) 0
  <2><a8f>: Abbrev Number: 2 (DW_TAG_member)
-    <a90>   DW_AT_name        : (strp) (offset: 0x51e): nb_subtract
+    <a90>   DW_AT_name        : (strp) (offset: 0x4fc): nb_subtract
     <a94>   DW_AT_decl_file   : (data1) 12
     <a95>   DW_AT_decl_line   : (data1) 65
     <a96>   DW_AT_decl_column : (data1) 16
     <a97>   DW_AT_type        : (ref4) <0x71c>, binaryfunc
     <a9b>   DW_AT_data_member_location: (data1) 8
  <2><a9c>: Abbrev Number: 2 (DW_TAG_member)
-    <a9d>   DW_AT_name        : (strp) (offset: 0x32dd): nb_multiply
+    <a9d>   DW_AT_name        : (strp) (offset: 0x3264): nb_multiply
     <aa1>   DW_AT_decl_file   : (data1) 12
     <aa2>   DW_AT_decl_line   : (data1) 66
     <aa3>   DW_AT_decl_column : (data1) 16
     <aa4>   DW_AT_type        : (ref4) <0x71c>, binaryfunc
     <aa8>   DW_AT_data_member_location: (data1) 16
  <2><aa9>: Abbrev Number: 2 (DW_TAG_member)
-    <aaa>   DW_AT_name        : (strp) (offset: 0xf44): nb_remainder
+    <aaa>   DW_AT_name        : (strp) (offset: 0xf17): nb_remainder
     <aae>   DW_AT_decl_file   : (data1) 12
     <aaf>   DW_AT_decl_line   : (data1) 67
     <ab0>   DW_AT_decl_column : (data1) 16
     <ab1>   DW_AT_type        : (ref4) <0x71c>, binaryfunc
     <ab5>   DW_AT_data_member_location: (data1) 24
  <2><ab6>: Abbrev Number: 2 (DW_TAG_member)
-    <ab7>   DW_AT_name        : (strp) (offset: 0xb52): nb_divmod
+    <ab7>   DW_AT_name        : (strp) (offset: 0xb39): nb_divmod
     <abb>   DW_AT_decl_file   : (data1) 12
     <abc>   DW_AT_decl_line   : (data1) 68
     <abd>   DW_AT_decl_column : (data1) 16
     <abe>   DW_AT_type        : (ref4) <0x71c>, binaryfunc
     <ac2>   DW_AT_data_member_location: (data1) 32
  <2><ac3>: Abbrev Number: 2 (DW_TAG_member)
-    <ac4>   DW_AT_name        : (strp) (offset: 0x3a92): nb_power
+    <ac4>   DW_AT_name        : (strp) (offset: 0x39db): nb_power
     <ac8>   DW_AT_decl_file   : (data1) 12
     <ac9>   DW_AT_decl_line   : (data1) 69
     <aca>   DW_AT_decl_column : (data1) 17
     <acb>   DW_AT_type        : (ref4) <0x741>, ternaryfunc
     <acf>   DW_AT_data_member_location: (data1) 40
  <2><ad0>: Abbrev Number: 2 (DW_TAG_member)
-    <ad1>   DW_AT_name        : (strp) (offset: 0x1c74): nb_negative
+    <ad1>   DW_AT_name        : (strp) (offset: 0x1c27): nb_negative
     <ad5>   DW_AT_decl_file   : (data1) 12
     <ad6>   DW_AT_decl_line   : (data1) 70
     <ad7>   DW_AT_decl_column : (data1) 15
     <ad8>   DW_AT_type        : (ref4) <0x6fc>, unaryfunc
     <adc>   DW_AT_data_member_location: (data1) 48
  <2><add>: Abbrev Number: 2 (DW_TAG_member)
-    <ade>   DW_AT_name        : (strp) (offset: 0x2cf5): nb_positive
+    <ade>   DW_AT_name        : (strp) (offset: 0x2c88): nb_positive
     <ae2>   DW_AT_decl_file   : (data1) 12
     <ae3>   DW_AT_decl_line   : (data1) 71
     <ae4>   DW_AT_decl_column : (data1) 15
     <ae5>   DW_AT_type        : (ref4) <0x6fc>, unaryfunc
     <ae9>   DW_AT_data_member_location: (data1) 56
  <2><aea>: Abbrev Number: 2 (DW_TAG_member)
-    <aeb>   DW_AT_name        : (strp) (offset: 0x700): nb_absolute
+    <aeb>   DW_AT_name        : (strp) (offset: 0x6de): nb_absolute
     <aef>   DW_AT_decl_file   : (data1) 12
     <af0>   DW_AT_decl_line   : (data1) 72
     <af1>   DW_AT_decl_column : (data1) 15
     <af2>   DW_AT_type        : (ref4) <0x6fc>, unaryfunc
     <af6>   DW_AT_data_member_location: (data1) 64
  <2><af7>: Abbrev Number: 2 (DW_TAG_member)
-    <af8>   DW_AT_name        : (strp) (offset: 0x2ca1): nb_bool
+    <af8>   DW_AT_name        : (strp) (offset: 0x2c34): nb_bool
     <afc>   DW_AT_decl_file   : (data1) 12
     <afd>   DW_AT_decl_line   : (data1) 73
     <afe>   DW_AT_decl_column : (data1) 13
     <aff>   DW_AT_type        : (ref4) <0x76b>, inquiry
     <b03>   DW_AT_data_member_location: (data1) 72
  <2><b04>: Abbrev Number: 2 (DW_TAG_member)
-    <b05>   DW_AT_name        : (strp) (offset: 0x26bf): nb_invert
+    <b05>   DW_AT_name        : (strp) (offset: 0x2668): nb_invert
     <b09>   DW_AT_decl_file   : (data1) 12
     <b0a>   DW_AT_decl_line   : (data1) 74
     <b0b>   DW_AT_decl_column : (data1) 15
     <b0c>   DW_AT_type        : (ref4) <0x6fc>, unaryfunc
     <b10>   DW_AT_data_member_location: (data1) 80
  <2><b11>: Abbrev Number: 2 (DW_TAG_member)
-    <b12>   DW_AT_name        : (strp) (offset: 0x15bc): nb_lshift
+    <b12>   DW_AT_name        : (strp) (offset: 0x158b): nb_lshift
     <b16>   DW_AT_decl_file   : (data1) 12
     <b17>   DW_AT_decl_line   : (data1) 75
     <b18>   DW_AT_decl_column : (data1) 16
     <b19>   DW_AT_type        : (ref4) <0x71c>, binaryfunc
     <b1d>   DW_AT_data_member_location: (data1) 88
  <2><b1e>: Abbrev Number: 2 (DW_TAG_member)
-    <b1f>   DW_AT_name        : (strp) (offset: 0x2b0f): nb_rshift
+    <b1f>   DW_AT_name        : (strp) (offset: 0x2ab5): nb_rshift
     <b23>   DW_AT_decl_file   : (data1) 12
     <b24>   DW_AT_decl_line   : (data1) 76
     <b25>   DW_AT_decl_column : (data1) 16
     <b26>   DW_AT_type        : (ref4) <0x71c>, binaryfunc
     <b2a>   DW_AT_data_member_location: (data1) 96
  <2><b2b>: Abbrev Number: 2 (DW_TAG_member)
-    <b2c>   DW_AT_name        : (strp) (offset: 0x1899): nb_and
+    <b2c>   DW_AT_name        : (strp) (offset: 0x184c): nb_and
     <b30>   DW_AT_decl_file   : (data1) 12
     <b31>   DW_AT_decl_line   : (data1) 77
     <b32>   DW_AT_decl_column : (data1) 16
     <b33>   DW_AT_type        : (ref4) <0x71c>, binaryfunc
     <b37>   DW_AT_data_member_location: (data1) 104
  <2><b38>: Abbrev Number: 2 (DW_TAG_member)
-    <b39>   DW_AT_name        : (strp) (offset: 0x548): nb_xor
+    <b39>   DW_AT_name        : (strp) (offset: 0x526): nb_xor
     <b3d>   DW_AT_decl_file   : (data1) 12
     <b3e>   DW_AT_decl_line   : (data1) 78
     <b3f>   DW_AT_decl_column : (data1) 16
     <b40>   DW_AT_type        : (ref4) <0x71c>, binaryfunc
     <b44>   DW_AT_data_member_location: (data1) 112
  <2><b45>: Abbrev Number: 2 (DW_TAG_member)
-    <b46>   DW_AT_name        : (strp) (offset: 0x28b4): nb_or
+    <b46>   DW_AT_name        : (strp) (offset: 0x285d): nb_or
     <b4a>   DW_AT_decl_file   : (data1) 12
     <b4b>   DW_AT_decl_line   : (data1) 79
     <b4c>   DW_AT_decl_column : (data1) 16
     <b4d>   DW_AT_type        : (ref4) <0x71c>, binaryfunc
     <b51>   DW_AT_data_member_location: (data1) 120
  <2><b52>: Abbrev Number: 2 (DW_TAG_member)
-    <b53>   DW_AT_name        : (strp) (offset: 0x30a2): nb_int
+    <b53>   DW_AT_name        : (strp) (offset: 0x3035): nb_int
     <b57>   DW_AT_decl_file   : (data1) 12
     <b58>   DW_AT_decl_line   : (data1) 80
     <b59>   DW_AT_decl_column : (data1) 15
     <b5a>   DW_AT_type        : (ref4) <0x6fc>, unaryfunc
     <b5e>   DW_AT_data_member_location: (data1) 128
  <2><b5f>: Abbrev Number: 2 (DW_TAG_member)
-    <b60>   DW_AT_name        : (strp) (offset: 0x608): nb_reserved
+    <b60>   DW_AT_name        : (strp) (offset: 0x5e6): nb_reserved
     <b64>   DW_AT_decl_file   : (data1) 12
     <b65>   DW_AT_decl_line   : (data1) 81
     <b66>   DW_AT_decl_column : (data1) 11
     <b67>   DW_AT_type        : (ref4) <0x96>
     <b6b>   DW_AT_data_member_location: (data1) 136
  <2><b6c>: Abbrev Number: 2 (DW_TAG_member)
-    <b6d>   DW_AT_name        : (strp) (offset: 0xdee): nb_float
+    <b6d>   DW_AT_name        : (strp) (offset: 0xdc1): nb_float
     <b71>   DW_AT_decl_file   : (data1) 12
     <b72>   DW_AT_decl_line   : (data1) 82
     <b73>   DW_AT_decl_column : (data1) 15
     <b74>   DW_AT_type        : (ref4) <0x6fc>, unaryfunc
     <b78>   DW_AT_data_member_location: (data1) 144
  <2><b79>: Abbrev Number: 2 (DW_TAG_member)
-    <b7a>   DW_AT_name        : (strp) (offset: 0x1775): nb_inplace_add
+    <b7a>   DW_AT_name        : (strp) (offset: 0x1744): nb_inplace_add
     <b7e>   DW_AT_decl_file   : (data1) 12
     <b7f>   DW_AT_decl_line   : (data1) 84
     <b80>   DW_AT_decl_column : (data1) 16
     <b81>   DW_AT_type        : (ref4) <0x71c>, binaryfunc
     <b85>   DW_AT_data_member_location: (data1) 152
  <2><b86>: Abbrev Number: 2 (DW_TAG_member)
-    <b87>   DW_AT_name        : (strp) (offset: 0x16be): nb_inplace_subtract
+    <b87>   DW_AT_name        : (strp) (offset: 0x168d): nb_inplace_subtract
     <b8b>   DW_AT_decl_file   : (data1) 12
     <b8c>   DW_AT_decl_line   : (data1) 85
     <b8d>   DW_AT_decl_column : (data1) 16
     <b8e>   DW_AT_type        : (ref4) <0x71c>, binaryfunc
     <b92>   DW_AT_data_member_location: (data1) 160
  <2><b93>: Abbrev Number: 2 (DW_TAG_member)
-    <b94>   DW_AT_name        : (strp) (offset: 0x234a): nb_inplace_multiply
+    <b94>   DW_AT_name        : (strp) (offset: 0x22ef): nb_inplace_multiply
     <b98>   DW_AT_decl_file   : (data1) 12
     <b99>   DW_AT_decl_line   : (data1) 86
     <b9a>   DW_AT_decl_column : (data1) 16
     <b9b>   DW_AT_type        : (ref4) <0x71c>, binaryfunc
     <b9f>   DW_AT_data_member_location: (data1) 168
  <2><ba0>: Abbrev Number: 2 (DW_TAG_member)
     <ba1>   DW_AT_name        : (strp) (offset: 0x14c): nb_inplace_remainder
     <ba5>   DW_AT_decl_file   : (data1) 12
     <ba6>   DW_AT_decl_line   : (data1) 87
     <ba7>   DW_AT_decl_column : (data1) 16
     <ba8>   DW_AT_type        : (ref4) <0x71c>, binaryfunc
     <bac>   DW_AT_data_member_location: (data1) 176
  <2><bad>: Abbrev Number: 2 (DW_TAG_member)
-    <bae>   DW_AT_name        : (strp) (offset: 0xef2): nb_inplace_power
+    <bae>   DW_AT_name        : (strp) (offset: 0xec5): nb_inplace_power
     <bb2>   DW_AT_decl_file   : (data1) 12
     <bb3>   DW_AT_decl_line   : (data1) 88
     <bb4>   DW_AT_decl_column : (data1) 17
     <bb5>   DW_AT_type        : (ref4) <0x741>, ternaryfunc
     <bb9>   DW_AT_data_member_location: (data1) 184
  <2><bba>: Abbrev Number: 2 (DW_TAG_member)
-    <bbb>   DW_AT_name        : (strp) (offset: 0x1dce): nb_inplace_lshift
+    <bbb>   DW_AT_name        : (strp) (offset: 0x1d81): nb_inplace_lshift
     <bbf>   DW_AT_decl_file   : (data1) 12
     <bc0>   DW_AT_decl_line   : (data1) 89
     <bc1>   DW_AT_decl_column : (data1) 16
     <bc2>   DW_AT_type        : (ref4) <0x71c>, binaryfunc
     <bc6>   DW_AT_data_member_location: (data1) 192
  <2><bc7>: Abbrev Number: 2 (DW_TAG_member)
-    <bc8>   DW_AT_name        : (strp) (offset: 0x32ae): nb_inplace_rshift
+    <bc8>   DW_AT_name        : (strp) (offset: 0x3235): nb_inplace_rshift
     <bcc>   DW_AT_decl_file   : (data1) 12
     <bcd>   DW_AT_decl_line   : (data1) 90
     <bce>   DW_AT_decl_column : (data1) 16
     <bcf>   DW_AT_type        : (ref4) <0x71c>, binaryfunc
     <bd3>   DW_AT_data_member_location: (data1) 200
  <2><bd4>: Abbrev Number: 2 (DW_TAG_member)
-    <bd5>   DW_AT_name        : (strp) (offset: 0x2bc6): nb_inplace_and
+    <bd5>   DW_AT_name        : (strp) (offset: 0x2b6c): nb_inplace_and
     <bd9>   DW_AT_decl_file   : (data1) 12
     <bda>   DW_AT_decl_line   : (data1) 91
     <bdb>   DW_AT_decl_column : (data1) 16
     <bdc>   DW_AT_type        : (ref4) <0x71c>, binaryfunc
     <be0>   DW_AT_data_member_location: (data1) 208
  <2><be1>: Abbrev Number: 2 (DW_TAG_member)
-    <be2>   DW_AT_name        : (strp) (offset: 0x30cc): nb_inplace_xor
+    <be2>   DW_AT_name        : (strp) (offset: 0x305f): nb_inplace_xor
     <be6>   DW_AT_decl_file   : (data1) 12
     <be7>   DW_AT_decl_line   : (data1) 92
     <be8>   DW_AT_decl_column : (data1) 16
     <be9>   DW_AT_type        : (ref4) <0x71c>, binaryfunc
     <bed>   DW_AT_data_member_location: (data1) 216
  <2><bee>: Abbrev Number: 2 (DW_TAG_member)
-    <bef>   DW_AT_name        : (strp) (offset: 0xa46): nb_inplace_or
+    <bef>   DW_AT_name        : (strp) (offset: 0xa2d): nb_inplace_or
     <bf3>   DW_AT_decl_file   : (data1) 12
     <bf4>   DW_AT_decl_line   : (data1) 93
     <bf5>   DW_AT_decl_column : (data1) 16
     <bf6>   DW_AT_type        : (ref4) <0x71c>, binaryfunc
     <bfa>   DW_AT_data_member_location: (data1) 224
  <2><bfb>: Abbrev Number: 2 (DW_TAG_member)
-    <bfc>   DW_AT_name        : (strp) (offset: 0x7f6): nb_floor_divide
+    <bfc>   DW_AT_name        : (strp) (offset: 0x7d4): nb_floor_divide
     <c00>   DW_AT_decl_file   : (data1) 12
     <c01>   DW_AT_decl_line   : (data1) 95
     <c02>   DW_AT_decl_column : (data1) 16
     <c03>   DW_AT_type        : (ref4) <0x71c>, binaryfunc
     <c07>   DW_AT_data_member_location: (data1) 232
  <2><c08>: Abbrev Number: 2 (DW_TAG_member)
-    <c09>   DW_AT_name        : (strp) (offset: 0xb95): nb_true_divide
+    <c09>   DW_AT_name        : (strp) (offset: 0xb7c): nb_true_divide
     <c0d>   DW_AT_decl_file   : (data1) 12
     <c0e>   DW_AT_decl_line   : (data1) 96
     <c0f>   DW_AT_decl_column : (data1) 16
     <c10>   DW_AT_type        : (ref4) <0x71c>, binaryfunc
     <c14>   DW_AT_data_member_location: (data1) 240
  <2><c15>: Abbrev Number: 2 (DW_TAG_member)
-    <c16>   DW_AT_name        : (strp) (offset: 0x3371): nb_inplace_floor_divide
+    <c16>   DW_AT_name        : (strp) (offset: 0x32e6): nb_inplace_floor_divide
     <c1a>   DW_AT_decl_file   : (data1) 12
     <c1b>   DW_AT_decl_line   : (data1) 97
     <c1c>   DW_AT_decl_column : (data1) 16
     <c1d>   DW_AT_type        : (ref4) <0x71c>, binaryfunc
     <c21>   DW_AT_data_member_location: (data1) 248
  <2><c22>: Abbrev Number: 11 (DW_TAG_member)
-    <c23>   DW_AT_name        : (strp) (offset: 0xdc5): nb_inplace_true_divide
+    <c23>   DW_AT_name        : (strp) (offset: 0xd98): nb_inplace_true_divide
     <c27>   DW_AT_decl_file   : (implicit_const) 12
     <c27>   DW_AT_decl_line   : (data1) 98
     <c28>   DW_AT_decl_column : (data1) 16
     <c29>   DW_AT_type        : (ref4) <0x71c>, binaryfunc
     <c2d>   DW_AT_data_member_location: (data2) 256
  <2><c2f>: Abbrev Number: 11 (DW_TAG_member)
-    <c30>   DW_AT_name        : (strp) (offset: 0x2ab5): nb_index
+    <c30>   DW_AT_name        : (strp) (offset: 0x2a5b): nb_index
     <c34>   DW_AT_decl_file   : (implicit_const) 12
     <c34>   DW_AT_decl_line   : (data1) 100
     <c35>   DW_AT_decl_column : (data1) 15
     <c36>   DW_AT_type        : (ref4) <0x6fc>, unaryfunc
     <c3a>   DW_AT_data_member_location: (data2) 264
  <2><c3c>: Abbrev Number: 11 (DW_TAG_member)
-    <c3d>   DW_AT_name        : (strp) (offset: 0xfa8): nb_matrix_multiply
+    <c3d>   DW_AT_name        : (strp) (offset: 0xf7b): nb_matrix_multiply
     <c41>   DW_AT_decl_file   : (implicit_const) 12
     <c41>   DW_AT_decl_line   : (data1) 102
     <c42>   DW_AT_decl_column : (data1) 16
     <c43>   DW_AT_type        : (ref4) <0x71c>, binaryfunc
     <c47>   DW_AT_data_member_location: (data2) 272
  <2><c49>: Abbrev Number: 11 (DW_TAG_member)
-    <c4a>   DW_AT_name        : (strp) (offset: 0x163f): nb_inplace_matrix_multiply
+    <c4a>   DW_AT_name        : (strp) (offset: 0x160e): nb_inplace_matrix_multiply
     <c4e>   DW_AT_decl_file   : (implicit_const) 12
     <c4e>   DW_AT_decl_line   : (data1) 103
     <c4f>   DW_AT_decl_column : (data1) 16
     <c50>   DW_AT_type        : (ref4) <0x71c>, binaryfunc
     <c54>   DW_AT_data_member_location: (data2) 280
  <2><c56>: Abbrev Number: 0
  <1><c57>: Abbrev Number: 10 (DW_TAG_typedef)
-    <c58>   DW_AT_name        : (strp) (offset: 0x1ab9): PyNumberMethods
+    <c58>   DW_AT_name        : (strp) (offset: 0x1a6c): PyNumberMethods
     <c5c>   DW_AT_decl_file   : (data1) 12
     <c5d>   DW_AT_decl_line   : (data1) 104
     <c5e>   DW_AT_decl_column : (data1) 3
     <c5f>   DW_AT_type        : (ref4) <0xa78>
  <1><c63>: Abbrev Number: 20 (DW_TAG_structure_type)
     <c64>   DW_AT_byte_size   : (data1) 80
     <c65>   DW_AT_decl_file   : (data1) 12
     <c66>   DW_AT_decl_line   : (data1) 106
     <c67>   DW_AT_decl_column : (implicit_const) 9
     <c67>   DW_AT_sibling     : (ref4) <0xcee>
  <2><c6b>: Abbrev Number: 2 (DW_TAG_member)
-    <c6c>   DW_AT_name        : (strp) (offset: 0x3785): sq_length
+    <c6c>   DW_AT_name        : (strp) (offset: 0x36e6): sq_length
     <c70>   DW_AT_decl_file   : (data1) 12
     <c71>   DW_AT_decl_line   : (data1) 107
     <c72>   DW_AT_decl_column : (data1) 13
     <c73>   DW_AT_type        : (ref4) <0x78b>, lenfunc
     <c77>   DW_AT_data_member_location: (data1) 0
  <2><c78>: Abbrev Number: 2 (DW_TAG_member)
-    <c79>   DW_AT_name        : (strp) (offset: 0x1a1a): sq_concat
+    <c79>   DW_AT_name        : (strp) (offset: 0x19cd): sq_concat
     <c7d>   DW_AT_decl_file   : (data1) 12
     <c7e>   DW_AT_decl_line   : (data1) 108
     <c7f>   DW_AT_decl_column : (data1) 16
     <c80>   DW_AT_type        : (ref4) <0x71c>, binaryfunc
     <c84>   DW_AT_data_member_location: (data1) 8
  <2><c85>: Abbrev Number: 2 (DW_TAG_member)
-    <c86>   DW_AT_name        : (strp) (offset: 0xdff): sq_repeat
+    <c86>   DW_AT_name        : (strp) (offset: 0xdd2): sq_repeat
     <c8a>   DW_AT_decl_file   : (data1) 12
     <c8b>   DW_AT_decl_line   : (data1) 109
     <c8c>   DW_AT_decl_column : (data1) 18
     <c8d>   DW_AT_type        : (ref4) <0x7ab>, ssizeargfunc
     <c91>   DW_AT_data_member_location: (data1) 16
  <2><c92>: Abbrev Number: 2 (DW_TAG_member)
-    <c93>   DW_AT_name        : (strp) (offset: 0x250e): sq_item
+    <c93>   DW_AT_name        : (strp) (offset: 0x24b3): sq_item
     <c97>   DW_AT_decl_file   : (data1) 12
     <c98>   DW_AT_decl_line   : (data1) 110
     <c99>   DW_AT_decl_column : (data1) 18
     <c9a>   DW_AT_type        : (ref4) <0x7ab>, ssizeargfunc
     <c9e>   DW_AT_data_member_location: (data1) 24
  <2><c9f>: Abbrev Number: 2 (DW_TAG_member)
-    <ca0>   DW_AT_name        : (strp) (offset: 0x3b1b): was_sq_slice
+    <ca0>   DW_AT_name        : (strp) (offset: 0x3a64): was_sq_slice
     <ca4>   DW_AT_decl_file   : (data1) 12
     <ca5>   DW_AT_decl_line   : (data1) 111
     <ca6>   DW_AT_decl_column : (data1) 11
     <ca7>   DW_AT_type        : (ref4) <0x96>
     <cab>   DW_AT_data_member_location: (data1) 32
  <2><cac>: Abbrev Number: 2 (DW_TAG_member)
-    <cad>   DW_AT_name        : (strp) (offset: 0x2e5e): sq_ass_item
+    <cad>   DW_AT_name        : (strp) (offset: 0x2df1): sq_ass_item
     <cb1>   DW_AT_decl_file   : (data1) 12
     <cb2>   DW_AT_decl_line   : (data1) 112
     <cb3>   DW_AT_decl_column : (data1) 21
     <cb4>   DW_AT_type        : (ref4) <0x7d0>, ssizeobjargproc
     <cb8>   DW_AT_data_member_location: (data1) 40
  <2><cb9>: Abbrev Number: 2 (DW_TAG_member)
-    <cba>   DW_AT_name        : (strp) (offset: 0x24e8): was_sq_ass_slice
+    <cba>   DW_AT_name        : (strp) (offset: 0x248d): was_sq_ass_slice
     <cbe>   DW_AT_decl_file   : (data1) 12
     <cbf>   DW_AT_decl_line   : (data1) 113
     <cc0>   DW_AT_decl_column : (data1) 11
     <cc1>   DW_AT_type        : (ref4) <0x96>
     <cc5>   DW_AT_data_member_location: (data1) 48
  <2><cc6>: Abbrev Number: 2 (DW_TAG_member)
-    <cc7>   DW_AT_name        : (strp) (offset: 0x36a7): sq_contains
+    <cc7>   DW_AT_name        : (strp) (offset: 0x3608): sq_contains
     <ccb>   DW_AT_decl_file   : (data1) 12
     <ccc>   DW_AT_decl_line   : (data1) 114
     <ccd>   DW_AT_decl_column : (data1) 16
     <cce>   DW_AT_type        : (ref4) <0x824>, objobjproc
     <cd2>   DW_AT_data_member_location: (data1) 56
  <2><cd3>: Abbrev Number: 2 (DW_TAG_member)
-    <cd4>   DW_AT_name        : (strp) (offset: 0x2655): sq_inplace_concat
+    <cd4>   DW_AT_name        : (strp) (offset: 0x25fe): sq_inplace_concat
     <cd8>   DW_AT_decl_file   : (data1) 12
     <cd9>   DW_AT_decl_line   : (data1) 116
     <cda>   DW_AT_decl_column : (data1) 16
     <cdb>   DW_AT_type        : (ref4) <0x71c>, binaryfunc
     <cdf>   DW_AT_data_member_location: (data1) 64
  <2><ce0>: Abbrev Number: 2 (DW_TAG_member)
-    <ce1>   DW_AT_name        : (strp) (offset: 0x1ac9): sq_inplace_repeat
+    <ce1>   DW_AT_name        : (strp) (offset: 0x1a7c): sq_inplace_repeat
     <ce5>   DW_AT_decl_file   : (data1) 12
     <ce6>   DW_AT_decl_line   : (data1) 117
     <ce7>   DW_AT_decl_column : (data1) 18
     <ce8>   DW_AT_type        : (ref4) <0x7ab>, ssizeargfunc
     <cec>   DW_AT_data_member_location: (data1) 72
  <2><ced>: Abbrev Number: 0
  <1><cee>: Abbrev Number: 10 (DW_TAG_typedef)
-    <cef>   DW_AT_name        : (strp) (offset: 0x3525): PySequenceMethods
+    <cef>   DW_AT_name        : (strp) (offset: 0x3486): PySequenceMethods
     <cf3>   DW_AT_decl_file   : (data1) 12
     <cf4>   DW_AT_decl_line   : (data1) 118
     <cf5>   DW_AT_decl_column : (data1) 3
     <cf6>   DW_AT_type        : (ref4) <0xc63>
  <1><cfa>: Abbrev Number: 20 (DW_TAG_structure_type)
     <cfb>   DW_AT_byte_size   : (data1) 24
     <cfc>   DW_AT_decl_file   : (data1) 12
     <cfd>   DW_AT_decl_line   : (data1) 120
     <cfe>   DW_AT_decl_column : (implicit_const) 9
     <cfe>   DW_AT_sibling     : (ref4) <0xd2a>
  <2><d02>: Abbrev Number: 2 (DW_TAG_member)
-    <d03>   DW_AT_name        : (strp) (offset: 0x242a): mp_length
+    <d03>   DW_AT_name        : (strp) (offset: 0x23cf): mp_length
     <d07>   DW_AT_decl_file   : (data1) 12
     <d08>   DW_AT_decl_line   : (data1) 121
     <d09>   DW_AT_decl_column : (data1) 13
     <d0a>   DW_AT_type        : (ref4) <0x78b>, lenfunc
     <d0e>   DW_AT_data_member_location: (data1) 0
  <2><d0f>: Abbrev Number: 2 (DW_TAG_member)
-    <d10>   DW_AT_name        : (strp) (offset: 0x2967): mp_subscript
+    <d10>   DW_AT_name        : (strp) (offset: 0x2919): mp_subscript
     <d14>   DW_AT_decl_file   : (data1) 12
     <d15>   DW_AT_decl_line   : (data1) 122
     <d16>   DW_AT_decl_column : (data1) 16
     <d17>   DW_AT_type        : (ref4) <0x71c>, binaryfunc
     <d1b>   DW_AT_data_member_location: (data1) 8
  <2><d1c>: Abbrev Number: 2 (DW_TAG_member)
-    <d1d>   DW_AT_name        : (strp) (offset: 0x848): mp_ass_subscript
+    <d1d>   DW_AT_name        : (strp) (offset: 0x826): mp_ass_subscript
     <d21>   DW_AT_decl_file   : (data1) 12
     <d22>   DW_AT_decl_line   : (data1) 123
     <d23>   DW_AT_decl_column : (data1) 19
     <d24>   DW_AT_type        : (ref4) <0x7fa>, objobjargproc
     <d28>   DW_AT_data_member_location: (data1) 16
  <2><d29>: Abbrev Number: 0
  <1><d2a>: Abbrev Number: 10 (DW_TAG_typedef)
-    <d2b>   DW_AT_name        : (strp) (offset: 0xe32): PyMappingMethods
+    <d2b>   DW_AT_name        : (strp) (offset: 0xe05): PyMappingMethods
     <d2f>   DW_AT_decl_file   : (data1) 12
     <d30>   DW_AT_decl_line   : (data1) 124
     <d31>   DW_AT_decl_column : (data1) 3
     <d32>   DW_AT_type        : (ref4) <0xcfa>
  <1><d36>: Abbrev Number: 10 (DW_TAG_typedef)
-    <d37>   DW_AT_name        : (strp) (offset: 0x1407): sendfunc
+    <d37>   DW_AT_name        : (strp) (offset: 0x13d6): sendfunc
     <d3b>   DW_AT_decl_file   : (data1) 12
     <d3c>   DW_AT_decl_line   : (data1) 126
     <d3d>   DW_AT_decl_column : (data1) 24
     <d3e>   DW_AT_type        : (ref4) <0xd42>
  <1><d42>: Abbrev Number: 8 (DW_TAG_pointer_type)
     <d43>   DW_AT_byte_size   : (implicit_const) 8
     <d43>   DW_AT_type        : (ref4) <0xd47>, PySendResult
@@ -1800,71 +1800,71 @@
  <1><d65>: Abbrev Number: 20 (DW_TAG_structure_type)
     <d66>   DW_AT_byte_size   : (data1) 32
     <d67>   DW_AT_decl_file   : (data1) 12
     <d68>   DW_AT_decl_line   : (data1) 128
     <d69>   DW_AT_decl_column : (implicit_const) 9
     <d69>   DW_AT_sibling     : (ref4) <0xda2>
  <2><d6d>: Abbrev Number: 2 (DW_TAG_member)
-    <d6e>   DW_AT_name        : (strp) (offset: 0x3b64): am_await
+    <d6e>   DW_AT_name        : (strp) (offset: 0x3aad): am_await
     <d72>   DW_AT_decl_file   : (data1) 12
     <d73>   DW_AT_decl_line   : (data1) 129
     <d74>   DW_AT_decl_column : (data1) 15
     <d75>   DW_AT_type        : (ref4) <0x6fc>, unaryfunc
     <d79>   DW_AT_data_member_location: (data1) 0
  <2><d7a>: Abbrev Number: 2 (DW_TAG_member)
-    <d7b>   DW_AT_name        : (strp) (offset: 0x23af): am_aiter
+    <d7b>   DW_AT_name        : (strp) (offset: 0x2354): am_aiter
     <d7f>   DW_AT_decl_file   : (data1) 12
     <d80>   DW_AT_decl_line   : (data1) 130
     <d81>   DW_AT_decl_column : (data1) 15
     <d82>   DW_AT_type        : (ref4) <0x6fc>, unaryfunc
     <d86>   DW_AT_data_member_location: (data1) 8
  <2><d87>: Abbrev Number: 2 (DW_TAG_member)
-    <d88>   DW_AT_name        : (strp) (offset: 0x2bd5): am_anext
+    <d88>   DW_AT_name        : (strp) (offset: 0x2b7b): am_anext
     <d8c>   DW_AT_decl_file   : (data1) 12
     <d8d>   DW_AT_decl_line   : (data1) 131
     <d8e>   DW_AT_decl_column : (data1) 15
     <d8f>   DW_AT_type        : (ref4) <0x6fc>, unaryfunc
     <d93>   DW_AT_data_member_location: (data1) 16
  <2><d94>: Abbrev Number: 2 (DW_TAG_member)
-    <d95>   DW_AT_name        : (strp) (offset: 0x2e8): am_send
+    <d95>   DW_AT_name        : (strp) (offset: 0x2d2): am_send
     <d99>   DW_AT_decl_file   : (data1) 12
     <d9a>   DW_AT_decl_line   : (data1) 132
     <d9b>   DW_AT_decl_column : (data1) 14
     <d9c>   DW_AT_type        : (ref4) <0xd36>, sendfunc
     <da0>   DW_AT_data_member_location: (data1) 24
  <2><da1>: Abbrev Number: 0
  <1><da2>: Abbrev Number: 10 (DW_TAG_typedef)
-    <da3>   DW_AT_name        : (strp) (offset: 0x15d8): PyAsyncMethods
+    <da3>   DW_AT_name        : (strp) (offset: 0x15a7): PyAsyncMethods
     <da7>   DW_AT_decl_file   : (data1) 12
     <da8>   DW_AT_decl_line   : (data1) 133
     <da9>   DW_AT_decl_column : (data1) 3
     <daa>   DW_AT_type        : (ref4) <0xd65>
  <1><dae>: Abbrev Number: 20 (DW_TAG_structure_type)
     <daf>   DW_AT_byte_size   : (data1) 16
     <db0>   DW_AT_decl_file   : (data1) 12
     <db1>   DW_AT_decl_line   : (data1) 135
     <db2>   DW_AT_decl_column : (implicit_const) 9
     <db2>   DW_AT_sibling     : (ref4) <0xdd1>
  <2><db6>: Abbrev Number: 2 (DW_TAG_member)
-    <db7>   DW_AT_name        : (strp) (offset: 0x277b): bf_getbuffer
+    <db7>   DW_AT_name        : (strp) (offset: 0x2724): bf_getbuffer
     <dbb>   DW_AT_decl_file   : (data1) 12
     <dbc>   DW_AT_decl_line   : (data1) 136
     <dbd>   DW_AT_decl_column : (data1) 20
     <dbe>   DW_AT_type        : (ref4) <0x648>, getbufferproc
     <dc2>   DW_AT_data_member_location: (data1) 0
  <2><dc3>: Abbrev Number: 2 (DW_TAG_member)
-    <dc4>   DW_AT_name        : (strp) (offset: 0x20c0): bf_releasebuffer
+    <dc4>   DW_AT_name        : (strp) (offset: 0x2065): bf_releasebuffer
     <dc8>   DW_AT_decl_file   : (data1) 12
     <dc9>   DW_AT_decl_line   : (data1) 137
     <dca>   DW_AT_decl_column : (data1) 24
     <dcb>   DW_AT_type        : (ref4) <0x677>, releasebufferproc
     <dcf>   DW_AT_data_member_location: (data1) 8
  <2><dd0>: Abbrev Number: 0
  <1><dd1>: Abbrev Number: 10 (DW_TAG_typedef)
-    <dd2>   DW_AT_name        : (strp) (offset: 0xc3b): PyBufferProcs
+    <dd2>   DW_AT_name        : (strp) (offset: 0xc22): PyBufferProcs
     <dd6>   DW_AT_decl_file   : (data1) 12
     <dd7>   DW_AT_decl_line   : (data1) 138
     <dd8>   DW_AT_decl_column : (data1) 3
     <dd9>   DW_AT_type        : (ref4) <0xdae>
  <1><ddd>: Abbrev Number: 8 (DW_TAG_pointer_type)
     <dde>   DW_AT_byte_size   : (implicit_const) 8
     <dde>   DW_AT_type        : (ref4) <0xda2>, PyAsyncMethods
